# =============================================================================
# Brewfile - Managed by chezmoi
# Install: brew bundle --file="$HOME/.config/brew/Brewfile"
# Dump current: brew bundle dump --force --file="$HOME/.config/brew/Brewfile"
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "browsh-org/homebrew-browsh"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "yakitrak/yakitrak"

# -----------------------------------------------------------------------------
# Homebrew Formulas (CLI tools)
# -----------------------------------------------------------------------------
brew "age"
brew "argocd"
brew "as-tree"
brew "atuin"
brew "awscli"
brew "azure-cli"
brew "bagels"
brew "bat"
brew "bitwarden-cli"
brew "browsh"
brew "btop"
brew "oven-sh/bun/bun"
brew "carapace"
brew "chafa"
brew "colima"
brew "coreutils"
brew "ctop"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
brew "dockerfmt"
brew "dua-cli"
brew "duti"
brew "eza"
brew "fabric-ai"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "gum"
brew "go"
brew "go-task"
brew "graphicsmagick"
brew "grep"
brew "hadolint"
brew "helm"
brew "httpie"
brew "imagemagick"
brew "iproute2mac"
brew "jj"
brew "jq"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lua"
brew "mas"
brew "mise"
brew "mysql"
brew "navi"
brew "neovim"
brew "nixfmt"
brew "node"
brew "yakitrak/yakitrak/obsidian-cli"
brew "ollama"
brew "opencode"
brew "openjdk"
brew "opentofu"
brew "p7zip"
brew "pandoc"
brew "parallel-disk-usage"
brew "poppler"
brew "pre-commit"
brew "postgresql@17"
brew "pyenv"
brew "qrencode"
brew "ripgrep"
brew "rust"
brew "serie"
brew "shellcheck"
brew "sketchybar"
brew "sops"
brew "sox"
brew "sshs"
brew "starship"
brew "statix"
brew "tealdeer"
brew "tfenv"
brew "thefuck"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "whisper-cpp"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zellij"
brew "zinit"
brew "zoxide"

# -----------------------------------------------------------------------------
# Casks (GUI Applications)
# -----------------------------------------------------------------------------
cask "aerospace"
cask "appcleaner"
cask "atuin-desktop"
cask "betterdisplay"
cask "chatgpt"
cask "claude"
cask "discord"
cask "finicky"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "kap"
cask "karabiner-elements"
cask "keyclu"
cask "linear-linear"
cask "obsidian"
cask "opencode-desktop"
cask "raycast"
cask "rectangle"
cask "soundsource"
cask "spotify"
cask "stats"
cask "steermouse"
cask "the-unarchiver"
cask "unity-hub"
cask "vivaldi"
cask "warp"

# -----------------------------------------------------------------------------
# Mac App Store Apps (via mas-cli)
# -----------------------------------------------------------------------------
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Hidden Bar", id: 1452453066
mas "Mark And Scribble", id: 1635403801
mas "Microsoft Outlook", id: 985367838
mas "Quick Sticky Notes", id: 6740142714
mas "Say No to Notch", id: 1639306886
