{"path":"loukas-mertzanis-cv 1.pdf","text":"LOUKAS MERTZANIS Cloud, DevOps and Software Engineer loukas.mertzanis@gmail.com +30 697 742 1967 linkedin.com/in/loukas-mertzanis Take responsibility, commit to excellence and drive impactful results. WORK EXPERIENCE Senior DevOps Engineer Sitecore 01/2025 - Present, Leading the development of a Streamlined Internal Platform for Accelerated Feature Delivery and onboarding application teams, eﬀectively improving DORA metrics > 400%. Software and Cloud Engineer Software Competitiveness International 10/2021 - 01/2025, Outsourced to a leading Tier 1 automotive provider, contributing to multiple advanced software products for one of the world's top 3 automotive manufacturers. Designed and developed over 40% of the microservices for an Over-The-Air (OTA) updating solution, actively used to update millions of vehicles across the world. Led the design and conﬁguration of Gitlab CI/CD pipelines and Infrastructure as Code for microservice deployments to an AWS Multi-Stage environment. Implemented and delivered successfully a full-stack Certiﬁcation Workbench for OTA components, leveraging a sophisticated microservices architecture. Ported a massive embedded navigation application with 80GB of C++ source code to the Android OS. Junior Software Developer FORTH - Institute of Computer Science 09/2020 - 09/2022, Information Systems Lab, HCI and Ambient Intelligence Research Lab. Implemented a Question Answering Evaluation pipeline with Machine Translation and BERT language models. Developed Alexa Skills and chat bots for smart environments. EDUCATION Computer science Department University of Crete 09/2019 - 07/2023, Completed all required courses for the 4-year degree in 2 years, a ﬁrst in the department’s history. 9.04 GPA, Top 1%. Certiﬁcations Amazon Web Services AWS Certiﬁed Solutions Architect - Associate (Scored 96%) SKILLS Programming Languages: Go, Python, C, C++, Java and Javascript DevOps & Cloud Technologies: AWS, Docker, Kubernetes, Github, GitOps-FluxCD, Terraform, Git, Gitlab CI/CD Collaboration Tools: Jira, Conﬂuence, Polarion Methodologies: DevOps, Agile, Git Workﬂows Soft Skills: Fast Learner, Cooperative, Adaptable, Excellent communication in English Other: Linux, Cloud SecOps, MLOps, PostgreSQL, Backstage PUBLICATIONS - PROJECTS A Comparative Evaluation for Question Answering by using Machine Translation and BERT Publication available here. Implementation available here. Tiresias: BERT-based Multilingual Question Answering through Machine Translation Publication available here. Presented at Workshop ISWC 2022, on Deep Learning for Knowledge Graphs. Alpha Language Compiler and Virtual Machine Collaboratively developed a compiler for a Javascript-like language and a runtime virtual environment for the bytecode of the compiler. Compiler repository. Virtual Machine repository. Personal Coding Projects A few public projects can be found in my github and gitlab proﬁles. Most of my projects are proprietary and available for discussion during an interview. HONORS & AWARDS ICS-FORTH Undergraduate Scholarship \"Stelios Orphanoudakis\" Awarded to the top 3 students of each academic year. Huawei Scholarship \"Seeds For the Future\" Awarded to only 5 students in the department based on academic excellence and extracurricular involvement. Aegean Airlines Scholarship \"Konta Stous Neous\" Granted for my top 1% performance in Greek National Level Examinations. Achievements/Tasks Achievements and responsibilities: Contributions: Achievements: Titles:","libVersion":"0.5.0","langs":""}