{"path":"Extras/Images/Pasted image 20250107222529.png","text":"lable 8-2. The Proauction-Grade Infrastructure Checklist Task Description Example tools [INe) Install the software binaries and all dependencies. Bash, Ansible, Docker, Packer Configure Configure the software at runtime. Includes port settings, TLS certs, service ~ Chef, Ansible, Kubernetes discovery, leaders, followers, replication, etc. Provision Provision the infrastructure. Includes servers, load balancers, network Terraform, CloudFormation configuration, firewall settings, IAM permissions, etc. Deploy Deploy the service on top of the infrastructure. Roll out updates withno ASG, Kubernetes, ECS downtime. Includes blue-green, rolling, and canary deployments. High availability ~ Withstand outages of individual processes, servers, services, datacenters, Multi-datacenter, multi- and regions. region NEEIY Scale up and down in response to load. Scale horizontally (more servers) Auto scaling, replication and/or vertically (bigger servers). [EENG Optimize CPU, memory, disk, network, and GPU usage. Includes query [UENEICR I tuning, benchmarking, load testing, and profiling. VisualVM LEn Configure static and dynamic IPs, ports, service discovery, firewalls, DNS, VPG, firewalls, Route 53 SSH access, and VPN access. The Production-Grade Infrastructure Checklist | 279 Task Description Example tools Security Encryption in transit (TLS) and on disk, authentication, authorization, ACM, Let's Encrypt, KMS, secrets management, server hardening. Vault Metrics Availability metrics, business metrics, app metrics, server metrics, events, CloudWatch, Datadog observability, tracing, and alerting. Logs Rotate logs on disk. Aggregate log data to a central location. [AERUEICANTIITTY PEE ) Make backups of DBs, caches, and other data on a scheduled basis. AWS Backup, RDS snapshots Replicate to separate region/account. Cost optimization Pick proper Instance types, use spot and reserved Instances, use auto Auto scaling, Infracost scaling, and clean up unused resources. Documentation Document your code, architecture, and practices. Create playbooks to READMEs, wikis, Slack, laC respond to incidents. IGH Write automated tests for your infrastructure code. Run tests after every ~ Terratest, tflint, OPA, InSpec commit and nightly.","libVersion":"0.5.0","langs":"eng"}