{"path":"Books/TravelGuide_ISS_2024-1.pdf","text":"IMB‘S INTERNATIONAL SUMMER SCHOOL 12 August – 20 September 2024 Epigenetics & Genome Stability of Health, Ageing & Disease Mainz, Germany Travel Guide Welcome to Mainz Founded by the Romans as Mogontiacum, Mainz is one of the oldest cities in Germany. With a history of over 2000 years, Mainz has much to offer: situated at the confluence of the Rhine and Main rivers, Mainz has a sizeable university, fine pedestrian precincts and a certain “savoir vivre” whose origins go back to the Napoleon’s occupation at the turn of the 18th century – at least that’s what the “Mainzer” say. Strolling along the Rhine river, enjoying the sun in the beer gardens, and sampling local wines in a half-timbered wine tavern in the Altstadt (old part of the city) are as much part of any Mainz visit as visiting the impressive Romanesque Dom St. Martin (St. Martin Cathedral), Marc Chagall’s ethereal windows in St. Stephan’s Kirche (Church of St. Stephan) or the first printed bible in the Gutenberg Museum. In the 15th century, local hero Johannes Gutenberg perfected moveable type and became known as the inventor of modern book printing – the man of the millennium. Not only is Mainz the capital of the federal state of Rhineland-Palatinate, but also one of the “Great Wine Capitals” of the world along with Bordeaux and Napa Valley. The Institute of Molecular Biology (IMB) is located at the Johannes Gutenberg University (Mainz University) campus. Please note: Smoking is prohibited in the IMB building. Please do not enter any restricted areas without previous authorisation. Welcome to the Institute of Molecular Biology IMB This document is an unofficial guide written by the International Summer School (ISS) Office at IMB. IMB cannot be held responsible for the accuracy of its content. For any inquiries about this guide, please contact the ISS Office. Welcome to the Institute of Molecular Biology IMB ISS Office: +49 6131 39 21600 or +49 152 3692 4556 (mobile) or iss@imb.de CONTACT Photos taken during the ISS may be used for future marketing and communication purposes in web & print. If you would not like to appear in these photos, please inform the ISS Coordinators. PHOTOGRAPHY Please share with us your travel itinerary if you haven’t done so yet, so that we can pick you up at Mainz Main Station (there is no reception at your accommodation). TRAVEL Keep all your travel tickets (boarding pass of your flight, train ticket Airport-Mainz, train tickets home-airport, etc.). We need you to give us the original tickets, so that you can receive a travel reimbursement. REIMBURSEMENT Take the train to Mainz • On arrival at Terminal 1 (A, B, C) or Terminal 2 (D, E) make your way to the Regional Train Station (S). Terminal 1 and 2 are connected by the “Sky Line“, a free monorail train leaving every 3 min. • The Regional Train Station (S) is located underground (Level 0) in Terminal 1, section B. There is also a long distance train station (T); please ignore it. • Your train: Train S8 (S-Bahn 8; do not take lines S1 or S9) Direction: Wiesbaden Hbf (from Platform 3) Frequency: every 30 min S8 Arriving at the airportHow to buy a train ticket Ticket machine step by step 1) Choose language 2) Select destination (Wiesbaden/Mainz) 3) Select „Single journey“ 4) Select the route of your travel (via Rüsselsheim) 5) Pay 6.30 EUR 6) Take your ticket (and change) At the Travelcenter Queue up at the Travelcenter (Reisezentrum) and buy it from the counter. You need to draw a number and may have to wait for a bit. At the ticket machine • You can buy your ticket from a machine. If you have Euros (coins and small bills) you can pay with cash. Navigation is available in English. • You can also pay with girocard, VisaCard or MasterCard. • The machine automatically dispenses change. • Tickets bought at the vending machines already have date & time on them, and don‘t need to be validated. 1 2 3 5 6.30 € Tariff Stage 04 Price 5.80 € 4 5.80 € Finding the train to Mainz Frankfurt (Main) Flughafen Regionalbahnhof Kelsterbach Raunheim Rüsselsheim Rüsselsheim Opelwerk Mainz-Bischofsheim Mainz- Gustavsburg Mainz Römisches Theater Mainz Hbf • Check blue sign: Regional trains [S], track 2-3 • The platforms are one level below the ticket hall and the Travelcenter. Proceed to platform 3. (Make sure you don‘t go to the long distance train station [T]) • Attention: At your location trains depart in two directions. Your direction on platform 3 is to Wiesbaden Hbf. Take only train S8. (Do not take trains S9 or S1, which also go to Wiesbaden but do not stop in Mainz) • The journey takes nearly 25 minutes. Get off the train at Mainz Main Station - Mainz Hbf. Mainz Main Station – Meeting point Frittenwerk Coming from Frankfurt Airport, you will arrive at platform 1, ground floor. Our meeting point: upper level (2nd floor), in front of “Frittenwerk” (french fries shop) Getting to your guest house Getting from Mainz Main Station to your guest house • At Mainz Main Station, take the exit “West” (you will see many bikes on your right hand side and a small parking lot straight ahead when you leave the building) • Walk straight ahead until you reach the main road (Binger Straße) • Turn right and follow the main road as indicated on the map (ca. 350m) • The guest houses are situated in the same building above a former gym and the entrance is hidden at the side of the building Mainz Main Station Your accommodation Bus stop “Hauptbahnhof West” Unterkunft Steinhauer Saarstraße 2 55122 Mainz  +49 700 11112223 www.mainz-unterkunft.de Exit West of Mainz Main Station Entrance Your arrival & accommodation First name Last name Apartment Main station pick-up time Elena Loseva App1 13:30 Julia Konczak App1 13:30 Carolina Vaccari Batista App1 16:40 Christina Chatzichrysou App1 20:15 Neil De Meuleneire App2 16:40 Kostantinos Kydonakis App2 13:30 Ümit Sude Böler App3 19:30 Claudia Deysi Palacios Sanchez App3 19:30 Caitlin Kiernan App4 13:30 Azhar Alamanova App4 16:40 In case your travels are significantly delayed, please let us know via text message or Whatsapp (+49 152 3692 4556) as soon as possible. We will then wait for you at the main station or coordinate a separate pick-up time. Travelling by bus or tram in Mainz Where to buy tickets • Ticket machine on the bus/tram: You can buy day- or single journey tickets at the machines on every bus/tram. You can pay only with debit card. Please note that bus drivers do not sell tickets. • Ticket machine at the stop: You can buy almost every ticket here. They accept cash and German debit cards (no credit cards!). • The customer center (Bahnhofplatz 6): you can buy every ticket and they accept cash, German debit cards and credit cards. • The Mainzer Mobilität App: You can download the App on your phone and use it to buy directly there your tickets. You can choose English as your preferred App language, and you can link the App for payments with your bank account (SEPA-Lastschrift), your credit card or PayPal account. A day ticket makes you save money already if you take public transport at least three times a day. The Wochenkarte makes sense if you plan on using it several times per week. The Deutschlandticket is valid for one calendar month across all Germany. It allows you to take all regional trains, as well as public transport in almost all Germany cities. Public transport in the whole Rhein-Main area (Mainz, Wiesbaden, Frankfurt, Darmstadt) is covered by this ticket. This ticket subscription is automatically renewed before the start of the next month. If you prefer to walk or take the bike and only use the bus sporadically, the Sammelkarten or single tickets are better options. Which ticket to buy • Kurzstrecke (covers a distance of max. 3 stops within up to 1,5 km) 2.20 € • Einzelfahrt (single ticket, one way) 3.55 € • Sammelkarten (collective ticket; 5 single tickets): 12.50 € • Tageskarte (day ticket): 7.10 € • Gruppentageskarte (day ticket for groups up to 5 people): 13.60 € • Wochenkarte (ticket for one week): 28.90 € • Deutschlandticket (D-ticket; monthly ticket): 49 € The mobile App Travelling by bus or tram in Mainz Mainz Main Station Bus Stop “Hauptbahnhof West” to the university to the city centre Your accommodation Your accommodation is about 450 m from the stop “Hauptbahnhof West” Getting from your guest house to IMB Unterkunft Steinhauer Saarstraße 2 55122 Mainz  +49 700 11112223 Web: www.mainz-unterkunft.de Getting from your guest house to IMB • By tram: take line 51 or 53 from the stop “Hauptbahnhof West” to “Friedrich-von-Pfeiffer Weg” or “Hochschule Mainz” • By bus: take one of the many buses stopping at “Friedrich-von-Pfeiffer Weg“ (54, 55, 56, 75, 650), which is a 10 min walk from IMB • By foot or by bike (it takes ca. 20 minutes): see map Johannes Gutenberg University campus Getting to IMB via public transport Tram lines to IMB Lines: 51 /53 (direction “Lerchenberg”) or 59 (direction “Hochschule Mainz”) Stop at “Friedrich-von-Pfeiffer-Weg“ or at “Hochschule Mainz”. Bus lines to IMB Lines: 54, 55, 56, 58, 630 Stop at “Friedrich-von-Pfeiffer-Weg“. Ticket machineLine #Stop To IMB To Mainz city center Tram 51 and 53 – from Hauptbahnhof West to IMB Mo - Fr: Monday until Friday // Samstag: Saturday // Sonn-/Feiertag: Sunday and holidays // Ferien RLP: school holidays (15 Jul – 23 Aug) Tram 51 and 53 – from IMB to Hauptbahnhof West Mo - Fr: Monday until Friday // Samstag: Saturday // Sonn-/Feiertag: Sunday and holidays // Schultagen: until 23 July // Ferien RLP: school holidays (15 Jul – 23 Aug) Bus stops at Mainz University Campus 2 3 1 4 1) Universität (tram and buses) 2) Friedrich-von-Pfeiffer Weg (tram and buses) 3) Hochschule Mainz (tram) 4) Hochschule Mainz (buses) Mainz – City overview Zoom-in of the City Center University Campus Historic City Centre IMB Train Station Your accommodation","libVersion":"0.5.0","langs":""}