{"path":"Books/ISS_Welcome_Guide_2024.pdf","text":"PROJECT BOOK INTERNATIONAL SUMMER SCHOOL 2024 IMB.DE/ISS 2 WELCOME TO IMB‘S INTERNATIONAL SUMMER SCHOOL 2024 DEAR ISS STUDENTS, Welcome to the International Summer School (ISS) on Epigenetics & Genome Stability in Health, Ageing & Disease organised by the Institute of Molecular Biology (IMB) in Mainz, Germany. We are excited to have you joining us for the next six weeks! The ISS will introduce you to research topics at the cut- ting edge of science through core ISS lectures, leading to collaborative scientific discussions. Throughout the ISS, you will interact with leading experts in the fields of epi- genetics & gene regulation, ageing, RNA biology, geno- me stability & DNA repair. Additionally, you will refine your presentation skills in a workshop focused on suc- cessfully presenting your research. Besides your scientific experience, you will get to know the scientific community at IMB and Mainz University. Through our supplementary programme of social activi- ties - including welcome dinners and tours - you will net- work with other young scientists in Mainz and all over the world. We are excited to welcome you in Mainz and hope that the programme we have prepared for you will make this experience unforgettable. To give you a memory of this experience, we put together this ISS Project Book. We hope you will enjoy the next weeks and look forward to meeting you! Best wishes, Chiara & Paula CONTACT US IN CASE OF QUESTIONS IMB BUILDING FORUM JOHANNES-GUTENBERG UNIVERSITY MEDIEVAL CATHEDRAL MAINZ imb.de/ISS If you have questions, you can email us (iss@imb.de) come to see us in our office (IMB‘s 2nd floor, room 02.315). During office hours, you can also call us at +49613126001. ISS Coordinators Chiara Galante Paula Werner 3 Greetings to everyone! We are happy to meet you and hope that you are as excited as we are to start these six weeks. PARTICIPANTS – ISS 2024 Kostantinos Kydonakis Location: Tympaki, Crete, Greece Studies: MSc in Bioinformatics Loves: playing cretan lyra (traditional instrument), reading, music listening, dancing and have fun with friends Scientific craze: transcriptomics, RNA biology, 3D genome organization, biochemistry, gene expression regulation Julia Kończak Location: Wrocław, Poland Studies: studying MSc in Genetics and Experimental Biology Loves: cats, coffee and wine tasting, jewellery making Scientific craze: the role of SUMOylation in DNA repair and replication stress Azhar Alamanova Location: Debrecen, Hungary Studies: studying MSc in Molecular Biology Loves: reading, playing board games, hiking Scientific craze: epigenetics, biochemistry of metabolism, behavioural biology Ümit Sude Böler Location: Ankara, Turkey Studies: studying MSc in Bioinformatics Loves: yoga, zumba, long walks, reading, tasting new foods & drinks Scientific craze: computational biology, systems biology, proteomics, personalized medicine Christina Chatzichrysou Location: Heraklion, Crete, Greece Studies: studying BSc in Biology, Molecular Biology & Biotechnology Loves: partying, dancing, cooking-baking, jewellery design, singing, going to the beach, hiking Scientific craze: structure-protein biology, skin biology, drug development Neil De Meuleneire Location: Ghent, Belgium Studies: completed MSc in Biology, starting MSc in Integrated Immunology Loves: swimming, teaching, film, Friday night drinks with a good conversation Scientific craze: molecular mechanisms of infections, cancer, ageing, physiology, zoology, biodiversity Cailtlin Kiernan Location: Galway, Ireland Studies: BSc in Biomedical Science Loves: hiking, rock climbing, outdoors, table tennis, tea n’ biscuits Scientific craze: coming up with acronyms to remember random cell signaling pathways Elena Loseva Location: Moscow, Russia Studies: BSc in Molecular Biology Loves: making new friends, exploring new places, juggling Scientific craze: bacterial defense systems against bacteriophages Claudia Deysi Palacios Sanchez Location: Lima, Peru Studies: BSc in Biology Loves: dancing, reading manga, traveling Scientific craze: neurobiology, ageing, how synapses encode memories Carolina Vaccari Batista Location: Porto Alegre, Brazil Studies: studying BSc in Pharmacy Loves: dancing, cooking, reading, outdoor activities, camping, traveling Scientific craze: biotechnology, molecular diagnosis, cancer genetics, microbiology, biopharmaceuticals 4 THE ISS GROUPS Find out more about the group leaders participating in the ISS 2024. CLAUDIA KELLER-VALSECCHI Institute: IMB Research field: Biology of gene dosage alterations (www.imb.de/research/keller-valsecchi) Sexual reproduction enables genetic variation within a population. The diploid state provides a “fail-safe” mechanism: When genes are perturbed in heterozygosity, the other allele can provide robustness and allow development to continue. Research in our laboratory focuses on elucidating the fundamental mechanisms and the physiological relevance of gene copy numbers for regulating cellular function in eukaryotes. We are interested in the causes and consequences of gene dosage alterations and their potential impact on developmental and pathogenic processes. Our lab aims to crack the gene dosage code and broadly covers the two areas of “Mechanism & Evolution” and “Physiology & Disease”. To investigate these topics, we use complementary approaches including genome engineering, transcriptomics, epigenomics, proteomics, biochemistry and single-molecule imaging. Our experimental models consist of murine stem cells and organoids, as well as human patient-derived cells. For evolutionary projects, we apply our molecular expertise to non-model organisms. RENÉ KETTING Institute: IMB Research field: Biology of non-coding RNA (www.imb.de/research/ketting) We study non-protein-coding functions of RNAs, with a particular focus on a family of small RNAs that act in so-called RNA interference (RNAi)-related pathways. All RNAi-related pathways share one common feature: a member of the Argonaute protein family that binds a small RNA molecule. These small non-coding RNAs provide sequence specificity to the Argonaute proteins; therefore their identity is critical for the functionality of RNAi regulatory pathways. We are currently working to understand how certain transcripts are selected to be turned into small regulatory RNAs, while others are not. This is crucial to understand, since small RNAs solely determine the target specificity of RNAi processes. We also work on understanding how small RNA pathways connect to other gene regulatory programmes, including those active during germ cell specification and differentiation. These RNA-driven mechanisms in the germline play an important role in resolving genetic conflicts, and we have a particularly keen interest in understanding how germ cells escape the ageing process. ANTON KHMELINSKII Institute: IMB Research field: Proteome organisation & dynamics (www.imb.de/research/khmelinskii) The functional state of a cell is ultimately defined by the state of its proteome, i.e. abundance, localisation, turnover and mobility of all proteins and their organisation in complexes and organelles. Numerous cellular quality control systems contribute to proteome homeostasis and operate throughout the protein life cycle, from synthesis to degradation. Selective protein degradation by the ubiquitin-proteasome system plays a key role in protein abundance and quality control, wherein a cascade of enzymes marks proteins with polyubiqui- tin chains for degradation at the proteasome. Despite the activity of such systems, proteome homeostasis declines with ageing and in numerous diseases, resulting in the accumulation of abnormal proteins and loss of cell functionality. We employ a multidisciplinary approach to dissect the mechanisms of protein quality control in yeast and human cells. Through a combination of molecular and cell biology techniques, biochemistry, computational biology, and developing genomic and proteomic approaches, we aim to systematically characterise the selective protein degradation machinery and patterns of protein turnover/ inheritance, down to the single-cell level. ISS - FACTS & NUMBERS 300 applicants for 10-15 positions each year 188 participants from 38 countries since 2012 Rated as “excellent” or “very good” by 99 % of participants 70 % “excellent” 29 % “very good” 5 THE ISS GROUPS Find out more about the group leaders participating in the ISS 2024. . JULIAN KÖNIG Institute: IMB Research field: Genomic views of the RNA world (www.imb.de/research/koenig) Posttranscriptional regulation is achieved by the cooperative action of RNA-binding proteins (RBPs) that recognise RNA sequences in the pre-mRNA and modulate cellular machineries such as the ribosome and spliceosome. The information in the RNA sequence and how it is interpreted by RBPs is called the messenger ribonucleoprotein (mRNP) code. Dysregulation of posttranslational modifications plays an important role in development and tissue identity and is implicated in diseases such as cancer. We aim to crack the mRNP code and obtain mechanistic insights into the regulation of splicing and translation. This requires unders- tanding the interplay between cis-regulatory RNA elements, trans-acting RBPs and the spliceosome. To study the RNA-binding activity of RBPs, our lab established the key technology in vitro iCLIP. We also developed a high-throughput screen of randomly mutated minigenes to decode the cis-regulatory landscape determining alternative splicing of a target gene. Our interests include, among others, mRNP assembly at splice sites, alternative splicing in paediatric leukaemia, the evolution of human splicing patterns and translational regulation. KATJA LUCK Institute: IMB Research field: Integrative systems biology (www.imb.de/research/luck) Protein interactions with DNA, RNA, metabolites and/or other proteins determine the function of genes and their protein products. Deciphering the cellular contexts in which protein interactions take place, how these interactions form and their functional outcome remains inherently difficult. Yet this knowledge is required to accurately predict how genetic mutations, toxins and pathogens alter protein interactions and thereby perturb cellular function and cause disease. We aim to develop integrative computational and experimental strategies that efficiently annotate protein interactions with informa- tion on their structure, function and cellular context. We then apply these approaches to predict and validate the molecular mecha- nisms of genome maintenance processes that are perturbed in neurodevelopmental disorders. We are currently focusing on predicting and experimentally validating the effects of mutations on protein interactions. We are also developing computational approaches to predict interfaces in protein interactions and a cross-linking mass spectrometry approach for medium-throughput mapping of protein interaction interfaces. Furthermore, we are characterising the mutational landscape of proteins implicated in neurodevelopmental disorders. CHRISTOF NIEHRS Institute: IMB Research field: DNA demethylation, DNA repair & reprogramming (www.imb.de/research/niehrs) In the genomes of many multicellular organisms, DNA methylation is an epigenetic mark associated with gene silencing. DNA methylation patterns vary in different tissues and during embryonic development, but little is known about how these changes are regulated. DNA methylation is a dynamic process and can be reversed by TET cytosine dioxygenases in an enzymatic process that is still incompletely understood. We showed that Growth arrest and DNA damage 45A (GADD45A) is a key player in active DNA demethylation via DNA repair and acts as an adapter protein that directs the DNA methylation machinery to speciﬁc loci. We use biochemical, molecular and cell biological approaches in different systems to address GADD45A function. In particular, we are interested in its role in DNA demethylation during development and ageing. Using embryonic stem cells or mouse and frog models, we study GADD45A’s role and its interaction with the DNA repair machinery, R-loops and other enhancer proteins. 6 THE ISS GROUPS Find out more about the group leaders participating in the ISS 2024. HELLE ULRICH Institute: IMB Research field: Ubiquitin, SUMO & the maintenance of genome stability (www.imb.de/research/ulrich) The DNA replication machinery cannot cope with defective templates due to DNA damage. To avoid a permanent arrest in this situation, cells have developed mechanisms of damage bypass allowing the replication machinery to “skip over” lesions without their actual removal. Ubiquitin and SUMO are small posttranslational modifiers involved in almost all signalling pathways of eukaryotic cells. Among others, they control the properties of the essential replication factor PCNA. We are particularly interested in how post- translational protein modifiers of the ubiquitin family control genome maintenance pathways and regulate other cellular processes. We have developed a system to introduce small DNA lesions into defined regions of the genome. Using chromatin immunoprecipitation combined with quantitative PCR or next-generation sequencing, we monitor the passage of the replisome and the recruitment of relevant repair factors in a time-resolved manner with high spatial resolution. We are also generating tools and methods to monitor and manipulate ubiquitin and SUMO in budding yeast and vertebrate cells to address their role in DNA damage bypass. SINA WITTMANN Institute: IMB Research field: The role of protein disorder in transcriptional regulation (www.imb.de/research/wittmann) Precise temporal and spatial transcriptional regulation is needed for proper development and to adequately react to environmental changes. Transcriptional activation is regulated by a complex, multi-step process that starts with the recognition of DNA elements through gene-specific transcription factors, followed by the recruitment of downstream factors, including RNA polymerase II, that allow the start of RNA synthesis. Recently, it was discovered that transcription initiation sites contain protein condensates with liquid-like properties too, an exciting new finding that can potentially explain puzzling cellular observations such as the simultaneous firing of different genes or the bursting behaviour of transcription. We have succeeded in reconstituting the formation of transcription factor condensates in vitro. However, little is known about their function and regulation within the cell. Our lab tries to decipher how condensates work to precisely regulate transcription so that different tissues can develop. STAMATIS PAPATHANASIOU Institute: IMB Research field: Functional consequences of errors in mitosis (www.imb.de/research/papathanasiou) To ensure the daughter cells will inherit the proper amount of genomic material, the fundamental process of cell division is tightly regulated. Nonetheless, this process is not error-proof and errors in mitosis are a hallmark of diseases such as cancer. Thus, understanding the origin and consequences of abnormal mitosis has been a central focus in tumour biology for decades. We recently described micronuclei, miniature nuclei that can be generated when chromosomes are mis-segregated in mitosis. We found that micronuclei can lead to inherited chromatin state defects and epigenetic instability, showcasing a novel, non-genetic role for these abnormal nuclear structures. To better understand how errors in mitosis and abnormal chromosomes might affect chromatin state, genome organisation and eventually cellular responses we are developing novel single-cell “omics” technologies and sophisticated cellular systems. Our ultimate goal is to uncover previously undescribed mechanisms of tumorigenesis and their vulnerabilities for the future design of novel therapeutic approaches. SIYAO WANG Institute: IMB Research field: Transgenerational consequences of DNA damage (www.imb.de/research/wang) The distinction between the somatic and germline programmes is maintained by epigenetic modifications. The somatic epigenome can be dynamically changed in response to various endogenous and exogenous stresses and affects development and ageing, while the germline epigenome remains in a repressive state to ensure a stable genome can be inherited by the consequent generations. A major threat to genome stability is posed by DNA damage. Post-translational modifications of histones, regulate DNA damage respon- se-related chromatin functions thus making chromatin a platform for successful DNA repair. In contrast to the transient process of DNA repair, many histone modifications can leave a long-term epigenetic memory in cells and be passed down to further generations, raising the question of whether DNA damage could reshape the epigenome in damaged cells and even affect their descendants. We study the role of histone modifications in genome stability, longevity and transgenerational inheritance using C. elegans as a model. 7 IMB GROUP LEADERS Find out more about the other IMB group leaders. PETRA BELI Institute: Mainz University & IMB Research field: Chromatin biology & proteomics (www.imb.de/research/beli) Maintenance of genome stability is essential for preventing cancer and premature ageing. A complex network of proteins and signalling pathways ensures genome maintenance in response to external stressors, such as UV light, and to DNA damage introduced through physiological processes, such as DNA replication and transcription. These mechanisms ensure protein homeostasis and prevent neurodegenerative diseases. We aim to identify and understand cellular DNA damage response mechanisms, in particular ubiquitin-depen- dent mechanisms that regulate proteome quality control and dynamics. We develop mass spectrometry-ba- sed proteomics methods to analyse DNA damage-dependent protein-protein interactions, as well as phosphorylation and ubiquitin- dependent mechanisms that regulate the DNA damage response. We aim to understand how transcription and protein complexes involved in transcription initiation and elongation are regulated in response to transcription-blocking lesions. Furthermore, we investigate mechanisms that regulate the levels of R-loops that frequently form during transcription to better understand their contribution to disease. We also study the contribution of the ubiquitin-proteasome system and autophagy to targeted protein degradation in different cellular compartments. ROOPESH ANAND Institute: IMB Research field: Mechanisms of DNA double-strand break repair (www.imb.de/research/anand) The DNA in our cells faces constant challenges from both intrinsic (cellular metabolites) and external (environmental) genotoxic agents. These challenges often result in various types of DNA lesions, including DNA double-strand breaks (DSBs) which, if incorrectly repaired, can lead to cancer. One of the predominant DSB repair pathways is homologous recombination (HR), which uses the sister chromatid as a template to restore the broken DNA duplex. Our primary focus lies in understanding DSB repair through homology-directed repair (HDR) pathways, including HR. Specifically, we are interested in elucidating the mechanisms of break-induced replication (BIR) and related repair pathways, which are highly mutagenic and utilise a conservative mode of replication for DSB repair. By employing biochemistry, single-molecule imaging techniques and cell-based assays, we additionally aim to define the biochemical and cellular functions of HELQ, a peculiar DNA helicase that can also anneal DNA strands, in maintaining genome stability through multiple HDR repair pathways. PETER BAUMANN Institute: Mainz University & IMB Research field: Telomere biology & chromosomal inheritance (www.imb.de/research/baumann) Telomere shortening occurs during normal cell proliferation and limits the lifespan of most cell populations. Elucidating the mechanisms by which chromosome ends are protected and maintained has far-reaching implications for the treatment of cancer and degenerative diseases. It is our overarching goal to identify compounds that can limit the lifespan of tumour cells or boost the proliferative potential of desired cell populations, and could therefore be useful in regenerative therapies or to promote longevity. Our group is working on understanding the assembly and regulation of telomerase. Ongoing studies in fission yeast are defining the roles of RNA chaperones in telomerase biogenesis and providing fundamental insights into chromosome end maintenance. We are also studying the biogenesis and regulation of the human telomerase. We showed that human telomerase RNA (hTR) processing is in kinetic competition with its degradation, an observation that hints at potential treatment options for telomerase insufficiency disorders. 8 IMB GROUP LEADERS Find out more about the other IMB group leaders. STEPHAN GRABBE Institute: University Medical Center Mainz & IMB Research field: Skin immunology & immunotherapy of skin tumours (www.imb.de/research/grabbe) Within my research group, we work to pursue several aspects of cutaneous and general immunology research. Most of our projects are located in the field of cellular immunology, with a focus on dendritic cells (DC) and regulatory T cells. Part of our research focuses on the evaluation of nano-vaccines, which target DC-surface receptors and co-deliver tumour-associated antigen in combination with immunostimulatory compounds to achieve profound induction of anti-tu- mour T helper cells and cytotoxic T cells responses. Additionally, we study the role of β2 integrins for DC-dependent autoimmune diseases. DOROTHEE DORMANN Institute: Mainz University & IMB Research field: Molecular mechanism of RNA-binding protein dysfunction in neurodegenerative diseases (www.imb.de/research/dormann) A common pathological hallmark of all neurodegenerative diseases is the accumulation of insoluble protein aggregates in degenerating brain areas. The main aggregating proteins found in FTD (frontotemporal dementia) and ALS (amyotrophic lateral sclerosis), two clinically and genetically related neurodegenerative diseases, are the ubiquitously expressed RNA-binding proteins (RBPs) TDP-43 and FUS, which regulate essential steps in mRNA processing and DNA damage repair. However, in the brain and spinal cord of ALS and FTD patients they aggregate in the cytoplasm of neurons and glia. This is thought to cause neuronal dysfunction and eventually neurodegeneration. The main objective of our research is to understand the molecular mechanisms underlying FTD and ALS, particularly those underlying RBP mislocalisation and aggregation, in order to develop new therapeutic approaches. We would also like to understand the physiolo- gical functions of neurodegeneration-linked RBPs, their regulation and how dysfunctional RBPs cause neurodegeneration. Our long-term goal is to unravel the control mechanisms that maintain cellular stress resilience and protect against protein aggregation and neurodegeneration, thereby allowing healthy ageing. NARD KUBBEN Institute: IMB Research field: Biology of ageing & ageing-related diseases (www.imb.de/research/kubben) Ageing is a prime pathological component of highly prevalent diseases such as cancer, diabetes, cardiovascu- lar, neurodegenerative and chronic kidney and lung diseases. Our lab is interested in unravelling the molecular mechanisms that underlie human ageing and finding ways to limit their impact on disease, helping to increase human health- and lifespan. We have genetically engineered a cell system in which we can chemically induce and titrate progerin expression, enabling us to control the onset, duration and severity of the cellular cascades that drive the formation of most well-known ageing hallmarks. This system captures early events in the ageing process and enables unbiased identification of molecular processes that trigger and propel cellular ageing while distinguishing them from bystander effects. We are currently focusing our research efforts on a genome-wide screen of molecular mechanisms that drive cellular ageing and characterising the molecular mechanisms by which progerin disrupts cellular proteostasis. Furthermore, we seek to identify in vivo therapeutic anti-ageing interventions for Hutchinson-Gilford Progeria Syndrome and other ageing-associated diseases. 9 IMB GROUP LEADERS Find out more about the other IMB group leaders. BRIAN LUKE Institute: Mainz University & IMB Research field: RNA-DNA hybrids, telomere biology & genomic instability (www.imb.de/research/luke) Linear chromosome ends are safeguarded by telomeres, which shorten during each cell division. Eventually, replicative senescence occurs as a result of DNA damage-checkpoint activation and acts as a tumour suppressor, but can also contribute to ageing. However, cancer cells escape the checkpoint barrier to re-elongate their telomeres and achieve immortality. We are interested in understanding how cells transition through replicative senescence when short/dysfunctional telomeres arise and checkpoints become activated. Using a combination of the budding yeast model system and human tissue culture, we are investigating the relationship between acquired drug resistance and checkpoint adaptation. We are also investigating how some cells are able to override the checkpoint signal, even though DNA damage persists. Finally, we study TERRA, a non-coding telomeric RNA that forms RNA-DNA hybrids at telomeres, and other forms of RNA/DNA hybrids during the cell cycle and senescence to understand how they regulate telomere homeosta- sis and genomic instability. JAN PADEKEN Institute: IMB Research field: Regulation of heterochromatin in response to genotoxic stress (www.imb.de/research/padeken) In multicellular eukaryotes, heterochromatin, defined by lysine 9 methylation on histone H3 (H3K9me), is responsible for silencing the transcription of satellite repeats and transposable elements to ensure genome stability, as well as silencing tissue-specific genes during development to maintain stable differentiated states. The loss of appropriately targeted heterochromatin potentially contributes to metastasis and cancer progression by silencing tumour suppressor genes and promoting immune escape, loss of tissue integrity and ageing. The mechanisms that mediate the establishment and targeting of H3K9me and heterochromatin are not yet understood. Our research explores how heterochromatin is altered upon exposure to persistent genotoxic stress and how this contributes to the adaptation of cells and tumours to their environment, as well as genomic and tissue integrity. We use C. elegans as a model in combination with powerful genetic tools, next-generation sequencing and quantitative microscopy to characterise heterochromatin changes. This will allow us to discover how the epigenetic response to DNA damage impacts diseases such as cancer, ageing and Cockayne Syndrome. EDWARD LEMKE Institute: Mainz University & IMB Research field: Synthetic biophysics of protein disorder (www.imb.de/research/lemke) Intrinsically disordered proteins (IDPs) exist in multiple conformations and are key to many vital biological processes, such as nucleocytoplasmic transport, transcription and gene regulation. They are also involved in protein misfolding in neurodegenerative diseases. Because they are hard to visualise, and therefore study, IDPs are termed the dark proteome. To study the dynamics of biological machineries containing IDPs from the single molecule to the whole cell level, we develop novel tools and use a multidisciplinary approach. We synergistically combine single-molecule and super-resolution fluorescence microscopy techniques with cutting-edge developments in chemical and synthetic biology, microfluidics and microscope engineering to increase the throughput, strength and sensitivity of the approach as a whole. Our work is accompanied by rigorous analysis of the physicochemical properties of IDPs and examines to what extent simple, known polymer concepts such as phase separation can be used to describe the function of IDP biopolymers in vivo. We are also interested in how disordered proteins play key roles in gene regulation and cellular ageing. 10 IMB GROUP LEADERS Find out more about the other IMB group leaders. SANDRA SCHICK Institute: IMB Research field: Genome Regulation by Chromatin Remodelling during Development & Disease (www.imb.de/research/schick) Genomic DNA is highly compacted into chromatin in order to fit into the nucleus of a cell. This packaging provides a regulatory layer for DNA accessibility and therefore all DNA-dependent processes, such as transcription, DNA repair or replication. ATP-dependent chromatin remodellers can modulate chromatin accessibility by moving or evicting nucleosomes. One particular class of chromatin remodellers known as BAF complexes exert highly specialised control of cellular processes through cell type-specific expression and composition patterns. Mutations in genes encoding BAF complex proteins occur in more than 20% of all human cancers and developmental diseases. The research in our lab aims to elucidate how chromatin modifying events are regulated and integrated and their impact on cellular processes in higher eukaryotes. Furthermore, we study the molecular basis of diseases caused by aberrant regulation of chromatin modifiers. We combine model systems such as stem cell differentiation and organoids with state-of-the-art experimental and computational techniques, including CRISPR/Cas9 genome editing, targeted protein degradation, (single-cell) genomics, and screening and imaging approaches. SUSANN SCHWEIGER Institute: University Medical Centre Mainz & IMB Research field: Genetic diseases of the central nervous system (www.imb.de/research/schweiger) In our genetics clinic, we see a large variety of patients with rare diseases, with a focus on neurodevelopmental and neurodegenerative disorders. To understand gene function in humans, we study our patients’ mutations in combination with their phenotypes. Moreover, we study gene function and disease mechanisms by repro- gramming patients’ cells as well as differentiate induced pluripotent stem cells into neural precursor cells, neurons and cerebral organoids. Mouse models and analysis in patient cohorts complete our methodological repertoire. Our work aims at understanding the molecular mechanisms underlying variability of clinical phenotypes. We further aim to develop experimental therapies for patients with rare disorders such as Huntington’s Disease, Birk-Barel Symdrome and X-chromosomal gene reactivation. KATHARINA PAPSDORF Institute: IMB Research field: Lipid homeostasis in aging and longevity (www.imb.de/research/papsdorf) Aging is characterized by the gradual decline of tissue function. Importantly, age progression can be slowed by various interventions, including an appropriate diet. For instance, diets rich in monounsaturated fatty acids (MUFAs) such as the Mediterranean one, correlate with longevity in humans. Specific MUFAs (e.g., oleic acid) can also extend the lifespan in C. elegans, suggesting that lipids are a powerful target to manipulate in the context of aging. The overarching goal of my lab is to decipher how specific lipids drive cellular changes that induce longevity, with a particular focus on the cellular organelles controlling these processes. We study this in C. elegans, as many of its lipid metabolism pathways are conserved in mammals. We combine cell biology and mass spectrometry coupled with genetics and screening techniques to dissect the function of both specific lipids and the organelles that process them for aging and longevity. 11 IMB GROUP LEADERS Find out more about the other IMB group leaders. OLIVER TÜSCHER Institute: University Medical Centre Mainz & IMB Research field: Neurocognitive mechanisms of mental resilience (www.imb.de/research/tuescher) Our interdisciplinary research group includes biologists, chemists, psychologists, physicians and computer scientists, enabling us to implement research from molecular mechanisms to clinical use. Our methods to investigate the mechanisms of healthy ageing span from preclinical lab work to clinical research. Our ultimate goal is that of fostering an ageing process that is as cognitively healthy and free of ailments as possible. Thanks to our findings, we aim to develop preventive, disease-modifying and therapeutic interventions. We work to identify and investigate biomarkers and mechanisms of (healthy) ageing in neuronal tissues, testing Intervention strategies on animal models. Using neuroimaging techniques, we translate this research to the human brain and study neural network mechanisms of resilient ageing – a conceptual framework we recently developed to explicitly understand and target those biological mechanisms protecting brain and body against functional loss caused by ageing and ageing-related diseases. SARA VIEIRA-SILVA Institute: University Medical Centre Mainz & IMB Research field: Human microbiome ecology (www.imb.de/research/vieira-silva) The Vieira-Silva Lab explores the ecology of host-associated microbial communities, with a focus on gut microbiota dynamics in health and disease in population cohorts, pre- and post-clinical (therapeutic) interventi- ons and across short-term perturbation studies. Our research focuses on understanding the ecological dynamics of human gut-associated microbial communities in healthy host-microbiome homeostasis and how their disturbance contributes to the risk of disease onset or progression. We apply quantitative approaches to population cohort studies and intervention trials to identify the mechanisms that drive the dynamics of the gut ecosystem in health, the determinants of its resilience to perturbations and the alterations that contribute to disease (dysbio- sis). Our objectives are to identify and quantify the contribution of the gut microbiome to the risk of disease development and help develop microbiota remediation strategies for (combined) therapeutic interventions. PHILIPP WILD Institute: University Medical Centre Mainz & IMB Research field: Systems medicine – A holistic approach to promoting healthy ageing (www.imb.de/research/wild) We have comprehensive experience in molecular epidemiology and systems medicine research, with a focus on investigating complex common diseases, which are strongly driven by ageing. Our research themes range from cardiovascular diseases, such as thrombotic disease and heart failure, to cardiometabolic conditions like obesity and type 2 diabetes mellitus, as well as infectious diseases with system-wide sequelae (SARS-CoV-2 and COVID-19) and cancers. Our key priority is the study of how the ageing process induces pathological changes. By using artificial intelligence (AI) methods and state-of-the-art high-throughput omics profiling techniques, we holistically integrate multi-omics data with environmental exposures, (sub)clinical parameters and advanced imaging data to discover new biomarkers and biosignatures, detect diseases at an earlier stage and predict their further progression. This serves as the basis for developing tailor-made therapies, diagnostics, prognostics and therapy-monitoring tools that best suit a patient’s response to therapy. LUKAS STELZL Institute: Mainz University & IMB Research field: Molecular Principles that Regulate Gene Expression by Liquid-Liquid Phase Separation (www.imb.de/research/stelzl) Liquid-liquid phase separation (LLPS) is a phenomenon where proteins or nucleic acids condense to form droplets within a solution. LLPS allows cells to form membraneless organelles like stress granules and is critical for proper cell function, as it helps to organise functions such as gene transcription in time and space. Dysregulation of LLPS is thought to be an important driver of ageing and age-related disease. Moreover, post-transcriptional regulation of gene expression by LLPS and biomolecular condensates has been shown to be critical in the development of germ cells, which go on to form eggs and sperm. We use computational techniques to study how LLPS provides robust gene regulation in development, as well as how posttranslational modifications and mutations can dysregulate LLPS in ageing and disease. Our group is contributing to the continuous development of multi-scale simulation methods for flexible and disordered biomolecules and LLPS. Integrative modelling will become increasingly important as more data becomes available and we want to understand more complex biological systems. 12 IMB’S FLOOR PLAN WHERE TO FIND… IMB’s Board Meeting Room The Welcome Breakfast will take place in the Board Meeting Room. It is located on the 2nd floor, above the reception. IMB’s Seminar Room Most of the events scheduled during the ISS will take place in the Seminar Room. It is located on the 2nd floor, in the centre of the building. You can access it from the staircase leading up from the reception or from the hallways parallel to the labs on either side (see floor plan above). IMB’s Science Lounge IMB’s Science Lounge is located at the very centre of IMB, on the 1st floor. It is both the physical and spiritual heart of IMB where our scientists relax, have a break or gather for an informal meeting. Here, you will find free coffee & tea and the vending machines. You can access it from the staircase leading up from the reception or from the hallways parallel to the labs on either side. The Science Lounge is equipped with a full kitchen (fridges, stove, oven, microwaves, sinks and dishwashers). Every lab has its own shelf in the fridge, where you can store your food. The Science Lounge is a common space and as such, all users are responsible for it (rather than the cleaning personnel). Thus, feel free to use it but please clean up immediately afterwards: put used dishes in the dishwashers, and if they contain clean dishes, please take a few minutes to empty them. 13 MAINZ UNIVERSITY’S CAMPUS © Johannes Gutenberg-Universität Mainz 04/2022 100 m 200 m0 m Ackermannweg Hanns- Dieter-Hüsch- W eg Dalheimer-WegDuesbergwegStaudingerweg Wittichweg Wittichweg Anselm-Franz-von-Bentzel-WegA.-F.-v.-Bentzel-WegF.-v.-Pfeiffer-Weg Johann-Joachim-Becher-W eg Jakob-Welder-Weg Jakob-Welder-WegJohannes-v.-Müller-WegF.-Straßmann-WegKoblenzer Straße SaarstraßeAlbert-Schweitzer-Straße Lucy-Hillebrand-Straße Hahn-Meitner-Weg 2.BA H H H H H H H H H H H H H H H H H H H H H H H H H H H Info- box NKoblenzer Straße Chemistry (forum west) Mainz Student Union Central University Canteen Physics District cooling Physical Chemistry Pharmacy Schulz-Horner Building Biomedical Research Center Technical Center Nuclear Physics Mainz Microtron Max Planck Institute for Polymer Research ( -P) MPI Mathematics Computer Science Institute of Molecular Biology Biochemistry Genetics Nuclear Chemistry Natural Sciences complex SB II Social Sciences Anatomy Anthro- pology Zoology Botany Chemistry Georg Forster Building La w and Economics Buildin g (Re W i) „ “ Alt e Mensa „ “ Muschel Forum universitatis University Library Philosophicum residential halls School of Music Sports gymnastics and natatorium stadium great gymnasium hall Max Planck Institute for Chemistry ( -C) MPI archery range small-sized soccer pitch artificial turf field beach volleyball and basketball facilities city center BKM Building Kantstraße 2 Helmholtz Institute MainzBioCenter IBioCenter II Botanic Garden mai n entrance Green School tennis courts Kita Kita Kita Philo- sophicum II CFP I School of Seeing716.253 4 greblessiKmA Isaac-Fulda-Allee 2b JGU Campus Map key under construction ATM or planned parking spaces day care center on-site student counseling JGU shop and Information Center - ZSB) Bicycle rental station University Administration bus/tram stop of the Academic Advising Student Service Center (incl. U A SSC P Kita H Aareon Building Hegelstr. 59 HDI Building Hegelstraße 61 zniaMGSE Protestant zniaMytinummoC tnedutS 1ßeipS remiehnesnoGmA zniaMGHK Catholic zniaMytinummoC tnedutS Saarstraße 20 main access route city highwayBretzenheim / LerchenbergGonsenheim U A SSC P P P P P P PP P P P P P P P 1 2 3 4 5 6 7 8 9 10 11 12 13 13 13 1. Bali Bistro €€: open Mon-Sun; Indonesian food, poke bowls & vegan; cash and debit card 2. Imbiss Diwan €: open Mon-Sat; oldest Turkish res- taurant on campus; cash and debit card 3. Kulturcafé €: open Mon-Sat; food, party & night life on campus; cash only 4. Baron €€: open Mon-Sat; privately run restaurant on campus, good food and nice social life; cash and debit card 5. Max Plank Cafeteria €€: open Mon-Fri; canteen of the Max Planck Institute, you can either eat there or get take away (bring your own Tupperware!); cash only 6. Mensa K3 Mainz €: open Mon-Fri; University of Ap- plied Sciences’ canteen; University card and Univer- sity app 7. BKM (Kantine der Bausparkasse Mainz) €: open Mon-Fri; canteen run by an external company; cash only 8. khg Mensa & Bistro €: open Mon-Fri; limited choice but food is homemade; cash, University card, Uni- versity app 9. Mens@ria / Zentralmensa €: open Mon-Fri; offers a variety of dishes; University card and University app 10. Caféteria insgrüne €: open Mon-Fri; snacks and cold dishes, no hot food; University card and Univer- sity app 11. Caféteria ReWi €: open Mon-Fri; a few hot dishes, sandwiches and salad; University card and Universi- ty app 12. Caféteria Bambus €: open Mon-Fri; a few hot dis- hes, sandwiches and salad; University card and Uni- versity app 13. Mini Mensa €: open Mon-Fri; small food tracks on three different locations on campus, each of them has a fixed menu for the entire week; University card and University app To know more about restaurants on campus, visit www.studying.uni-mainz.de/refreshment-facilities-on-campus/ 14 YOUR STAY IN MAINZ DURING THE ISS YOUR ACCOMMODATION All international ISS students stay at the holiday apartments from Unterkunft Steinhauer. They are all located in the same building at the following address: Saarstraße 2; 55122 Mainz. You will most likely share a room with one of your fellow students. Bedsheets and towels will be provided by the guest house. The apartments are equipped with a kitchenette. The biggest flat includes a washing machine with drier. You will have to buy your own washing powder; we suggest to buy a larger box and share it with the other ISS students. You will also have access to the terrace on the roof (access between the 2nd and the 3rd floor from the staircase). If you are a smoker, please smoke on the terrace. All the rooms and apartments are non-smoking! Please note that, due to noise regulations, the terrace cannot be used after 22:00. The same noise regulations apply to the rooms, meaning that after 22:00 noise must be kept to a minimum. CASH & PAYMENTS IN GERMANY Germans love cash! This means that many shops and restau- rants do not accept payment with debit cards. The pandemic changed things, but you may still be asked to pay Bargeld (= cash). Thus, we suggest to make sure you have some cash with you when you go outside, or to check in advance if the restaurant where you will go accepts payments with debit card. Some restaurants may accept payment with debit card only starting from e.g. 10€ or 20€. All supermarkets and drugstores accept debit cards. TRAVEL & TRANSPORT IN MAINZ AND BEYOND Public Transport Public transport will get you around in Mainz, Wiesbaden and the Rhine-Main Region. Your guest houses are just a few minutes away from Mainz Main Station (Hbf), which is the main hub for most busses, trams and trains. Tickets can be purcha- sed: at the vending machines on busses and trams (payment: card only); at the vending machines you will find at some stops (payment: cash or card); via the Apps of the local public transport companies (payment: card or PayPal). Here is a brief explanation of the most useful type of tickets: Einzelfahrschein (Single Ride) This ticket is valid from the moment of purchase and has to be used right away; you don’t need to validate it. It is valid for one ride only, but you can change the line if needed. Kurzstrecke (Short Hop) This ticket is cheaper and can be used if you travel up to 3 stops, within 1.5 km from the starting station. Sammelkarte (Carnet á 5 tickets) This includes five single ride tickets: buying a Sammelkarte saves you 20% on the price of a single ticket. Each ticket from the Sammelkarte needs to be validated upon entering the bus or tram. Wochenkarte (Seven-Day Ticket) This ticket is valid on seven consecutive days (including start day) for Mainz and Wiesbaden. It is only available at the MVG office near the main station (Bahnhofsplatz 6a) or at the ticket machines. Tageskarte/Gruppentageskarte (Day Ticket/Day Ticket for groups) Perfect for day trips. Hop on and off as often as you like. Valid until 5 a.m. of the following day. You can get day tickets for a single person or for groups of up to five people. The group ticket pays off already when two people are travelling together. You can get these tickets at the MVG office near the main station (Bahnhofsplatz 6a) or at the ticket machines. You can look up other tickets, schedules and connections on the webpage (German only): www.mainzer-mobilitaet.de. BIKE If you enjoy getting around the city by bike, you can rent one on campus at the Unibike-Kollektiv (unibike.org). They stock a variety of second-hand bikes, which they also rent out. You will have to pay the full price of your rented bike in advance as a deposit. When you return the bike, the deposit will be returned and you will only be charged a weekly fee. Jakob-Welder-Weg (in the small shed in front of the student apartments) Opening hours: Tue - Thu: 10:00-13:00; 14:30-17:00 (on Wed until 19:00) Contact: +49 (0) 0179 4318646 15 YOUR STAY IN MAINZ DURING THE ISS TRAIN You will find train connections to almost every city: www.bahn.com/en You can also download the DB Navigator App for your Smart- phone. The App searches for the best routes via public transportation. LONG DISTANCE BUS This can be a cheap alternative to traveling by train and discover other places in Germany. Take a look at the following websites from different bus companies for connections. www.flix.com/ WIFI IN THE CITY CENTRE While being in the city centre, you can use the city’s WiFi (in German: WLAN) for free at several locations (see link below). Just connect to the network “M-Hotspot” and accept their terms and conditions (AGBs). You will then be connected to the local WiFi hotspot. All information about the public WiFi in Mainz can be found here (German only): https://www.mainzer-stadtwerke.de/engagement/m-hotspot IN CASE YOU GET SICK We hope you will have a pleasant stay in Germany, but it may happen that you get sick. If this is the case and you want to see a doctor, you can either go to a general practitioner (“Hausarzt” in German) or to a hospital. Often, foreign or travel insurance are not accepted. This means for you: if you see a doctor you will most likely have to pay your visit in advance and arrange the reimbursement with your insurance. During the weekend, in cases that do not require ambulance, you can check-in with the emergency medical service (“Ärzt- licher Notfalldienst”) or the pharmacy emergency service (“Apotheken-Notdienst”). Here you can look up the pharmacy emergency service (German only): https://www.aponet.de/service/notdienstapotheke-finden/ suchergebnis/0/55122.html DOING SOME SPORTS A 1-minute-walk away from your guesthouse is a swimming pool, the “Taubertsbergbad”, with indoor and outdoor pools: www.mainzer-taubertsbergbad.de. If you are into bouldering, you can go to the “Blockwerk”: www.blockwerk.info. RECYCLING For most of the bottles and cans in Germany, you pay a deposit (Pfand, for an amount of 8-25 cents depending on the type of container you buy). You can return these bottles in the supermarkets in special machines, where you get a voucher with the amount of the deposit. If a bottle or an item at the supermarket is tagged with “Mehrwegpfand”, it means that you can get your money back for the bottle/can. If they are marked with “Pfandfrei”, you won’t. ADDRESS OF THE EMERGENCY MEDICAL SERVICE: University Medical Center Mainz Langenbeckstraße 1 55131 Mainz Building 605, Ground Floor Phone: 116117 www.kv-rlp.de/patienten/patientenservice-116117/ In every case of emergency you can call 112. This number is the international emergency number. You will be patched through to the right department. 16 INTERNATIONAL PHD PROGRAMME Our International PhD Programme has two recruitment calls per year. If you would like to join an international and diverse group of scientists working on topics at the forefront of research, don’t miss the opportunity and apply! For more information visit www.imb.de/phd APPLY BY 17 APR Molecular Biomedicine & Ageing With Projects On + Immunology + Neurodegeneration + Cardiovascular diseases + Computational biology + Translational research Your Benefits + Cutting-edge research + International working environment + Advanced training & career development + Fully funded positions Mainz, Germany www.imb.de/PhD IPP student Juanjuan Wang, Beli group With Projects On + DNA repair + RNA biology + Epigenetics + Ageing + Structural biology Your Benefits + Cutting-edge research + International working environment + Advanced training & career development + Fully funded positions www.imb.de/PhD APPLY BY 17 APR Molecular Mechanisms in Genome Stability & Gene Regulation Mainz, Germany IPP student Gaurav Joshi, Niehrs group Includes students from 3 institutions (IMB, JGU & UMC) plus 4 affiliated research networks 500 applications per call (2 calls per year) Currently 201 PhD students from 55 countries in 59 research groups 152 graduates since 2011 36 % Germany 31 % Rest of world 33 % Europe IPP - FACTS & NUMBERS 17 FAQs THE PROGRAMME Do I have to participate in all ISS events? Yes, all activities listed on the schedule are compulsory for all ISS students. Do I have to listen to all the talks during the Advanced Lectures on “Gene Regulation, Epigenetics and Genome Stability”, even if they are not relevant to my project or the field I am interested in? Yes, the talks are intended to get all students up to the same level. At the same time, it aims at giving the students a comprehensive overview of the current state of the art in the fields of epigenetics, developmental biology and genome stability. Please remember to sign the attendance list every day. Whom do I have to tell if I get sick? If you are sick, please inform your lab supervisor, your group leader and the ISS Coordinators. Will I get a certificate? Yes, after you have handed in your report you will receive a certificate that confirms your participation in the ISS, as well as your accomplishments. IMB Will I get a key card to access IMB? Unfortunately, we cannot provide you with a key card. During the ISS you can access IMB through the Science Lounge. How can I access the WiFi at IMB? In your welcome folder you will find instructions on how to access the WiFi. You will get a guest account. Please use this responsibly. ACCOMMODATION The WiFi signal at the accommodation is very bad. Can something be done about that? If you encounter problems with your WiFi at the guesthouse, please let us know. We will try to get in touch with the landlords and see if there is something that can be done. Can I get fresh towels/ a fresh bedcover? Yes, of course. Just talk to Mr Steinhauer. They will provide you with fresh towels and sheets. Where can I do my laundry? The biggest apartment includes a washing machine with dryer. You will need only to buy the washing detergent. If possible, try to share the use of the machine also with the other ISS students living in the smaller apartments (we suggest to share the washing detergent). Alternatively, there is a washing room in the cellar. The key to your apartment also opens the cellar door. If it doesn’t work, it might just be necessary to get used to the lock and the door a bit. Where can I buy coins for the washing machines in the cellar? You can buy the coins from Mr Smalskis, who is in the same building where you are accommodated. There is a 3 € fee to pay for the use of the washing machines in the cellar. RESEARCH TOPICS IN THE ISS BIOINFORMATICS & COMPUTATIONAL BIOLOGY EPIGENETICS & NUCLEAR DYNAMICS DNA REPAIR & GENOME STABILITY RNA BIOLOGY AGEING & DISEASE PROTEOSTASIS & PHASE SEPARATION THANK YOU ALL FOR JOINING THE ISS 2024! We hope that your ISS experience has been as exciting & interesting as ours. CONTRIBUTORS Many thanks to Chiara Galante, Paula Werner, Christine Omeni & Cheryl Li for the editorial support, and to Christine Stockmeyer and Alexandra Beckmann from cala media. We are thankful to all the ISS 2024 partici- pants, Ralf Dahm, the SFB 1361, the SFB 1551 and the ISS group leaders, PhD students and postdocs for making this great experience possible. www.imb.de KEEPING IN TOUCH We would love to stay in touch with you. If you also want to connect with us, former ISS participants and members of the ISS groups, we encourage you to join our ISS Alumni group within Mainz University’s Gutenberg Alumni Network. Register here: gutenberg-netzwerk.uni-mainz.de Like us on Facebook at www.facebook.com/imb-mainz and follow us on Twitter @imbmainz and LinkedIn www.linkedin.com/school/institute-of- molecularbiology-imb-/","libVersion":"0.5.0","langs":""}