{"path":"Extras/Images/Pasted image 20240127161630 1.png","text":"First Last Elasticsearch / Elastic search DevOps Engineer Wilmington, Delaware * +1-234-456-789 + professionalemail@resumeworded.com - linkedin.com/in/username WORK EXPERIENCE Resume Worded, New York, NY 09/2015 — Present Education technology startup with 50+ employees and S100m+ annual revenue Elasticsearch / Elastic search DevOps Engineer e Managed the elastic search and Confluent Kafka infrastructure for 21+ leading tech companies in the country. e Trained 11+ development teams with the setting up, troubleshooting, and automating of cluster management and other routine tasks e Provisioned cluster, nodes, indexes, mapping, sharding, replication, and other administrative tasks in the first 20+ days. e Brainstormed with 13+ Dev Leads to exceed the needs of dev teams concerning the CI/CD framework, component monitoring, stats, and incident escalation. Polyhire, London, United Kingdom 10/2012 — 08/2015 NYSE-listed recruitment and employer branding company DevOps Engineer e Installed and maintained a logging cluster using Logstash, ElasticSearch, and Kibana as a centralized solution to parse logs from 47+ applications and docker containers. e Reviewed all AWS accounts and environments to avoid extra costs; decreased ~83% of the company's annual bills. e Spearheaded internal IT security, network maintenance, firewall configuration, VPN connections, and 11+ other tasks related to office infrastructure. Growthsi, London, United Kingdom 01/2010 - 09/2012 Career training and membership SaaS with 150,000 paying users Systems Administrator e Architected scalable applications and infrastructure for 33+ projects using a micro-services architecture that handles a 750K user base. e Developed continuous integration and deployment pipelines for 28+ applications in multiple environments within 72 hours on the job. e Provided expert IT consultancy to a 15-member senior management team while simultaneously assisting in the technology provisioning process. Access Control Specialist, ABC Company, London, United Kingdom 11/2008 — 12/2009 IT Technician, XYZ Company, London, United Kingdom 07/2005 - 10/2008 EDUCATION Resume Worded University, New York, NY 06/2005 Bachelor of Science — Electronics & Communication Engineering SKILLS Hard Skills: Container Orchestration (Advanced), Troubleshooting (Experienced), Application Monitoring Techniques: ElasticSearch Administration, Kafka/Confluent Cloud, Elastic Search Queries, Automated Deployments","libVersion":"0.5.0","langs":"eng"}