{"path":"Extras/Images/Pasted image 20240127161605 1.png","text":". San Francisco, CA 12345 Fi rst La st +1 234 567-890 first.last@resumeworded.com . . N . Ku bernetes DevOps Eng ineer linkedin.com/in/resumeworded Kubernetes DevOps Engineer with five years of hands-on experience in architecting/ automating and optimizing mission-critical deployments over a large infrastructure. Led teams of 5-15 people across technology, business, and design departments. EXPERIENCE SKILLS Resume Worded, New York, NY Kubernetes, Linux, Bash, . Jenkins, and Python Kubernetes DevOps Engineer ' ontinuous integration an January 2020 - Present conti Integrati d R Continuous Delivery (CI/CD), e Deployed and managed applications running on a mix of Kubernetes, AWS, Agile Methodologies, Scrum and GCP, and introduced optimization; resulted in a $15k savings per month ’ e Collaborated with product managers, business stakeholders, and fellow engineers to design and incorporate infrastructure solutions that were used by +14k customers. EDUCATION e Owned forecasting and planning infrastructure requirements result in 99% application uptime. Resume Worded e Automated the deployment of 90+ cloud servers using Docker, Kubernetes, University and AWS with the help of python B.S. in Business e Reduced lead times by 16% and failures by 80% using Puppet and Zabbix Management, Minor in Data e Analyzed, revised, and finalized the specification for tools installation, Analytics build, and deployment automation for 40+ services January 2012 New York, NY Growthsi, Remote . e Awards: Resume Worded Operations Analyst Teaching Fellow (only 5 I 6 awarded to class), Dean’s July 2016 - January 2020 List 2012 (Top 10%) e Transformed market data into actionable strategies for continual process Rel c . change; resulting in an efficiency increase of 65% ° O; eeééglonsofl(lgzggfch ) e Developed an automated system to track business process ordering which Statistics, Linear Algebra reduced claim loss by 23% Completed one-vear . - e Implemented a modern technology-based method to capture system failure stu dpabroa q Wi; and to monitor system discrepancies, which improved the process by 30%. . v . . Singapore University Resume Worded, Boston, MA PROJECTS Operations Analyst January 2012 - June 2016 e Created continuous integration pipeline usin e Designed plans to enhance operations and suggested structure ]enkgins- re dzci dthe & improvement for an overall organization that boosted productivity levels by a ’ . % evelopment cycle time 25%. by 10% e Identified and evaluated project risks, and devised risk-mitigation v strategies to reduce risk; led to a 25% increase in ROIL e Developed a comprehensive understanding of optimization and using problem-solving and analytical skills; raising efficiency by 15%","libVersion":"0.5.0","langs":"eng"}