{"path":"Extras/Images/Pasted image 20240127161615.png","text":"First Last o Senior DevOps Engineer - Swansea, United Kingdom - +44 123456789 RELEVANT WORK EXPERIENCE - firstlast@gmail.com SKILLS Resume Worded, L ondon, United Kingdom Education technology startup with 50+ employees and S100m+ annual revenue Tadhmiesl Sl Senior DevOps Engineer 06/2021 - Present ~ * Cloud Computing - Jenkins e Supported the infrastructure of a $200M company, including AWS EC2 . Microsoft Azure instances, RDS databases, Elastic Load Balancers, S3 buckets, Route53 DNS . Shell Scripting I’eCOI’dS, and ClOUdfront CDN distribution. . Continuous |n‘tegra‘tion e Automated deployment of 7 new servers using Ansible playbooks to reduce - Amazon Web Services (AWS) manual effort by 92%. e Spearheaded migration of all servers to AWS, reducing cost by 64% and Industry Knowledge: increasing server performance by 87%. - Cloud Computing e Reduced deployment time from 4 days to 30 minutes using Ansible - Configuration Management automation tool for configuration management within 5 months. + Agile Methodologies Polyhire, London, United Kingdom Tools and Software: NYSE-listed recruitment and employer branding company + Terraform o - Ansible System Administrator 08/2019 - 05/2021 - B e Reduced average server downtime by 67% through improved monitoring * Microsoft Azure processes and 24/7 maintenance checks. e Installed new operating systems on 33 servers using VMware vSphere 5.5 LEMEREREE, (ESXi), 5 months after resuming at the company. + English (Native) e Created a comprehensive inventory of all hardware, software, supplies, and ’ Romgman (=) _ . - Spanish (Conversational) documentation for 87 servers. e Managed the client/server configuration and performance-tuning of crucial . ) . . EDUCATION infrastructure to ensure seamless business operations by setting up secure Wi-Fi, LAN, and VolP networks at 200 remote locations. University of New York Growthsi, London, United Kingdom & Barcelona, Spain Bachelor of Science Career training and membership SaaS with 150,000 users Computer Science New York City, New York Release Manager 06/2018 - 07/2019 B e Introduced 19 bug-tracking databases and auto generated product defects reports that enabled 400 developers to track and fix bugs before releasing OTHER them to 700K clients. ° Ir?crea.sed softwqre developmen’F teqm productivity by 56% (1 OQO hours) . Puppet Certified vis-a-vis the previous year, resulting in an annual cash cost avoidance of STM. . Jenkins Certified e Mentored ateam of 35 engineers by introducing fun activities during annual meetings while reducing the turnover rate for 17 months. e Overhauled department project management workflow with an enterprise resource planning system, which cut record turnaround time from 5 days to 10 minutes. PREVIOUS EXPERIENCE Linux Engineer, ABC Company, London, UK 06/2017 - 05/2018 Developer, XYZ Company, New York, USA 06/2016 — 05/2017 Software Engineer (Internship), ABC, New York, USA 07/2014 - 05/2015","libVersion":"0.5.0","langs":"eng"}