{"path":"Extras/Images/Pasted image 20240127161419 1.png","text":"First Last DevOps Manager Sacramento, California + +1-234-456-789 - professionalemail@resumeworded.com -« linkedin.com/in/username WORK EXPERIENCE Resume Worded, New York, NY 09/2015 — Present Plans and manages DevSecOps automation in 30+ African cities DevOps Manager e Directed a team of 20+ DevOps engineers, QA, and operations teams to drive initiatives and continuous improvement with a 70% success rate. e Implemented CI/CD pipelines, leveraging tools that resulted in a 65% reduction in deployment time and increased software quality by 90%. e Collaborated with 10+ security teams to implement and maintain secure coding practices, vulnerability scanning, and compliance standards and received 100% positive feedback. e Created and executed deployment automation procedures that minimized errors by 80% and raised the frequency of releases by 89%. Polyhire, London, United Kingdom 10/2012 — 08/2015 Provides coherent distributed middleware that connects software components and applications Middleware Engineer e Supervised a team of developers and engineers, overseeing the design, development, and deployment of technology solutions for 100+ HNIs. e Brainstormed with 30+ clients and stakeholders to understand business requirements, define project scope, and develop strategic technology plans in the first month of employment. e Participated in pre-sales activities, including client presentations, solution design, and proposal development, resulting in 70% successful business acquisitions. Growthsi, London, United Kingdom 07/2010 - 09/2012 Specializes in outsourcing software development services for global IT teams Technology Lead e Worked closely with 20+ database administrators, engineers, and security teams to ensure seamless integration of middleware components with the underlying infrastructure. e Managed and administered middleware on 10+ platforms, including IBM WebSphere and Apache Tomcat, overseeing installation, configuration, and patching processes with a 77% success rate. e Cooperated with development teams to provide middleware expertise, offering guidance on best practices, methodologies, and performance optimization techniques with a 76% implementation rate. Graduate Research Assistant, ABC Company, London, United Kingdom 11/2008 — 12/2009 Java Developer (Intern), XYZ Company, London, United Kingdom 07/2005 - 10/2008 EDUCATION Resume Worded University, New York, NY 06/2005 Associate of Science — Computer Software Engineering SKILLS Hard Skills: Kubernetes, Shell Scripting, Continuous Integration, Networking, Cloud Computing, Automation, Techniques: Agile methodologies, Amazon Web Services (AWS), DNS Management, Release Management","libVersion":"0.5.0","langs":"eng"}