{"path":"Extras/Images/Pasted image 20240127160520 1.png","text":"First Last o DevOps Engineer - Worcester, United Kingdom - +44 1234567890 WORK EXPERIENCE - first.last@gmail.com SKILLS Resume Worded, L ondon, United Kingdom Career training and membership SaaS with 150,000 paying users Hard Skills: DevOps Engineer 08/2021 - Present ~ * CV/CDPipelines ) ) ) - - Configuration Management e Reviewed all AWS accounts and environments to avoid additional costs, o NEwerk Adieiziien decreasing 63% of quarterly bills. . Cloud Computing e Maintained the IT infrastructure, VPN, and MPLS connections between 80+ . Automation branch offices and 30+ security systems. - Continuous Integration e Collaborated with 20+ IT support team members to troubleshoot and install devices, hardware failures and network-related problems. Techniques: e Developed atool that enabled 250+ developers to deploy virtual machines - Agile Methodologies within 45 seconds against 10+ minutes recorded in previous years. . - Virtualization - Systems Administration Polyhire, London, United Kingdom NYSE-listed recruitment and employer branding company Tools and Software: . - Bash System Admin 10/2019 - 07/2021 - Shell Seraiing e Reduced programming time to 20 days against 15 weeks by devising a - SQL modular framework for creating backend code in Python and Django. + Elasticsearch e Analyzed user errors and corrected 2400+ lines of problematic codes, reducing computer system downtime by 74% YoY. LEMEUEDEE e Transformed the web server of Polyhire from an obsolete Apache to a LAMP ’ Engl'Sh,(Nat'Ve), stack, enhancing site performance by 89%. ' zom?nr:a%(Nat've)t, i e Consolidated all CRM databases into a single VM, which improved + Spanish (Conversational) accessibility and saved the company $1500+ monthly. EDUCATION Growthsi, London, United Kingdom & Barcelona, Spain Augmented reality startup with 50+ employees and S100m+ annual revenue University of New York SQL Programmer 11/2018 - 09/2019 Associate of Applied Science Information Technology e Attracted 700+ weekly downloads on Bitbucket by developing an open-source New York City, New York SQL parser, including parsing trees, syntax analysis, and run-time error 10/2011 - 06/2014 detection. e Designed a transaction processing functionality to handle TM simultaneous OTHER client requests by updating a server application. e Created queries and shell scripts to prod.U(.:.e office metric files and . CompTIA Network+ transferred them to the cloud for accessibility by 240+ field teams. . Elastix Certified Engineer e Streamlined a complex business process into 10K lines of code, enabling users without programming backgrounds to create sales order requests via client applications. PREVIOUS EXPERIENCE Junior Software Engineer, ABC Company, London, UK 06/2017 - 10/2018 Mobile Developer, XYZ Company, New York, USA 01/2016 - 05/2017 Software Tester (Internship), ABC, New York, USA 07/2014 - 12/2015","libVersion":"0.5.0","langs":"eng"}