{"path":"Extras/Images/Pasted image 20240127161645 1.png","text":"First Last AWS Lambda Engineer Winston-Salem, North Carolina *+ +1-234-456-789 - professionalemail@resumeworded.com -« linkedin.com/in/username AWS lambda engineer with 10+ years of experience leveraging AWS Lambda and associated services to build scalable, high-performance applications. Key achievement: spearheaded the adoption of AWS X-Ray for performance monitoring, which led to a 70% decrease in response time anomalies and enhanced system reliability. RELEVANT WORK EXPERIENCE Resume Worded, New York, NY 2015 — Present AWS Lambda Engineer e Designed AWS Lambda functions for 20+ critical microservices, achieving 73% cost savings via serverless architecture optimizations. e Collaborated with 10+ cross-functional teams to establish AWS Lambda best practices and coding standards, leading to a 29% decrease in deployment failures. e Implemented automated testing for Lambda functions, increasing code coverage by 40+ meters and reducing production defects by 44%. e Mentored 120+ junior engineers in Lambda development, contributing to a 65% reduction in onboarding time for new team members. Growthsi, San Francisco, CA 2013 - 2015 Cyber Security Analyst e Initiated an SIEM solution that cut incident response time by 45 minutes and improved threat detection accuracy by 78%. e Conducted regular vulnerability assessments and penetration tests, reducing critical vulnerabilities by 81% YoY. e Developed 30+ innovative security policies and procedures, ensuring 100% compliance with GDPR and ISO 27001 standards. e Automated routine security tasks using Python scripts, which saved an average of 48 hours monthly in the first quarter of 2015. Resume Worded Exciting Company, San Francisco, CA 2011 - 2013 Junior Cloud Developer e Assisted in deploying and managing cloud resources on AWS, leading to a 73% reduction in infrastructure costs. e Collaborated on developing AWS CloudFormation templates, improving infrastructure provisioning speed by 19.4%. e Partnered with a 10-person DevOps team to optimize CI/CD pipelines, reducing deployment times by 20% within three months of employment. EDUCATION Resume Worded University, New York, NY 2011 Associate of Science — Computer Programming SKILLS Technical Skills: AWS X-Ray (Advanced), Jenkins, (Experienced), Travis Cl, Git, AWS CloudWatch, Python, Node js, Languages: Finnish (Native), ltalian (Fluent), Russian (Conversational)","libVersion":"0.5.0","langs":"eng"}