{"path":"Extras/Images/character_cheatsheet.png","text":"Record your character’s name here Chosen Background Chosen Alignment e.g. Evan, the not so Terrible eg. Soldier e.g. Lawful Good In the race section of the players handbook there are lists of suggested names and naming tradidions for your chosen race. Chosen Race Your real (unless you're Batman) name e.g. Woodland EIf eg. | don't know.. Jim? Chosen class and character level Record XP gained from playing Inspiration allows you to pick a roll to have advantage on e.g. Fighter, 3 (if multiclassing add info here) Note: You can do milestone levelling Note: You can't store inspitation for later use, either have it or you don't. DMs award inspiration when you play out your personality traits, give in to the drawbacks presented by a flaw or bond, and xotl'l r:u rretr‘ iAf b \" d off otherwise portray your character in a compelling way. ote-Armor takes time to put on ana ol . . \\ Unarmored: 10 + DEX (unless your class has a feature), Characters have a proficiency bonus determined by level N\\ DUNGEONS &DRAGONS@ P . — Armored: Specified Armor Entry + DEX (Unless it's heavy) Note: Your proficiency bonus can’t be added more than once. ’_4.; P = N H \\’ Everyone has the same proficiency at the same levels. Levels 1-4 = +2, —] ] Bonus. added I ik Rolls el B = 43 vl BHP = 4, [valis TEMIE = <05, (el 730 = +6 - CLASS & LEVEL BACKGROUND PLAYER NAME Note: Initiative is rolled to determine the turn order of combat : : : l Calculated by 1d20 + DEX Y = S lls and cl dd additional b f |_——==1 CHARACTER NAME = RACE ALIGNMENT EXPERIENCE POINTS o e o ——— ] How far you can move in combat - Your chosen race determines your movement speed - = Movement speed changes depending on you mode of transport, The 6 Ability Scores | 7 N\\ 7 N\\ 7 N environment and spells cast on you A quick description of your character's physical and mental characteristics. 1 i 4 Strength (STR), measuring physical power ) a . Dexterity (DEX), measuring agility | | Nt N\\ ARMOR Self-descriptions that make you stand out Constitution (CON), measuring endu_r elniez > QINTATIVE ) Y, Be specific about your character's interests and opinions ( ) £ /Vr\\v/t_eclglgen{({‘/\\eﬂg;\\l‘f), measuring reas?_nlng a;'.d n?e,':; ory A . v 7 7 N PERSONALITY TRAITS eg. Instead of “I'm quick to anger” try “I'm quick to throw an insult in jest lsdom ; Measuring perception ana insig < = but get angry when insults are directed at me.” Charisma (CHA), measuring force of personality O _ Strength \\’ & 4 Calculating Ability Scores \\ A | O __ pexterity I ' ' Fundamental moral and ethical principles A quick description of your character’s physical and mental characteristics. | [l | O __ constitution Your character's alignment is a good place to start _ Calculate by rolling 4d6's and adding the top 3 together. Do this 6 times to o Intelligence CURRENT HIT POINTS IDEALS. eg. Fairness. | never target people who can't afford to lose a few coins. get 6 scores. Eg. | roll a 4, 2, 6 & 3, add 3+4+6 = a score of 13. ( . ) - (Lawful) N A O ___ Wisdom Each ability also has a Modifier defined by the Ability Score { O __ charisma i ' ' Connections to people, places and events Modifiers range from -5 (for an Ability Score of 1) to +10 (for a Score of 30) I 1| X SAVING THROWS )\\ Specifically one/two of the above that are important to you Calculate: -10 from the Ability Score, half that (rounded down) = Modifier. g 'S N TEMPORARY HIT POINTS 7 BONDS eg. Family, a town or a fond memory. Your DM may use these in the E.g. A Score of 13 is a +1 Modifier (13-10=3, 3/2=1.5 rounded down to 1) \\ | e N\\ . \\ 7 N campaign to direct your character to take specific action f fn b 1§ O __ Acrobatics ) SUCCESSES . . (Cltares il el SEeie GRS Witk Gy } . { ) ) I o00 Vices, compulsions, fears, or weaknesses Note: Classes in the Player’s Handbook recommend priority scores. =3 A O __ Animal Handling raiures Q=0O=0 ’ ‘ Amiring et semEane el caulE ol E.g. Druids cast spells with their WIS so that should be your highest score [e] Arcana ) L P with CON being the second highest — \\ HIT DICE ) oearHsaves ) A FLAWS / eg. Once | start drinking, it's hard for me to stop. Your DM may use these to 9 9 : \\ | O ___ Athletics - make your character act against best interests f Il O ___ Deception 7 N 7 N q b | © — Histo | Maximum health your character has “‘.,, - O __ mnsight ‘ Determined by your class’hit dice + constitution modifier O ___ Intimidation eg. Druids hit dice is 1d8. Ist level = 1d8 + Contitution modifier Y o Investigation ‘ For every level after add 1d8 roll + Constitution modifier ,“ ', O ___ Medicine Hit points on top of your maximum health O ___ Nature Some spells/classes give temporary hit points B . . d ) o Perception Temporary hit points to not regenerate and are the first to be lost when Attempt to resist a spell, a trap, a poison, a disease, or threat. N . 4|l 5 T your character is damaged. Roll 1d20 and add your appropriate Modifier. — Performance . . . Each Class gives proficiency in at least two Saving Throws. If your character T 1 O _ Persuasion If you hit O hit points y‘?“ &S kr_'OCkec_’ out . . is proficient in the Saving Throw, add the proficiency bonus as well. ) q o Religion Roll 1d20 on your turn .to see if you survive or 'j-j’e' healing can SRS el 8 — - - s - ( h — You roll once per turn in combat, 11 or above is a success, 10 or below is a Each Ability Score is broken down into specific skills O __ sleight of Hand failure. If you roll 3 sucesses you stabalise, if you roll 3 failures you die. Your Class & Background tells you specific skills you can be proficient in q b O ___ stealth P— Use the relevant Modifier to add to your roll. If you have choosen for your B . 4l o Survival | You'_‘ hit dice ba_se_‘j on your chosen class character to be proficient in a skill, add your proficiency bonus as well. — q ) Total: HOV‘_/ ':”0'73/ h_’t a.’lceyou have left to roll | i \\ SKILLS J \\ ATTACKS & SPELLCASTING (f)————4 eg. A Druid's hit dice is a d8. At 3rd level they have 3d8's they can roll during - “ a short rest to regain health equal to what they roll. Y e ) ) l A / ('/.\\‘ Your race, class and background give these l N\\ / Learn these so you don'’t forget about them during your campaign! / \\ eg. Race: Wood Elves give the feature “Dark Vision”. Class: Driud gives the ('-’ feature “Wild Shape’, Background: Hermit gives the feature “Discovery” (@D, € ( l A= Y4 (;1“:; The name of your weapon N/ Some weapons have special names eg. Your starting weapons will just be basic swords or axes, you might find = . = - rare weaponry that has a given name like “The King’s Hammer” You will use to to see if you notice traps or sneaky enemies | | . A Note: Your DM will probably use this so as not to arouse suspicion OTHER PROFICIENCIES & LANGUAGES S 2 FEATURES & TRAITS 7 The bonus you add to your d20 roll to try and hit something Calculate by 10 + WIS. +5 for advantage, -5 for disadvantage. A creature | Note: I\\.Aelee/Flnesse/Pa.nged char.1.ge whether you should U= _STR/ DEX must beat this score on a stealth check to not be noticed by your character. | eg. Using a shortsword: STR Modifier (melee weapon) + Proficiency bonus (ifyou are proficient). Race & Class tells you your proficient weapons. The dice used for damage and the type of damage Record you equipment here Note: Add your STR/DEX modifier to the damage roll for your total damage Your class & background determine starting equipment eg. Using a shortsword: 1d6 + Strength modifier, piercing damage. You Record your character’s proficiencies & languages These include items you get from your “pack’, any armor and must use the same modifier for both attack and damage bonus'. These are determined by your Race, Class & Background material components List of available weapons or combat spells e.g. Race: Wood Elves can speak “Common & Elvish” & are 5 5 p proficient in muliple weapons Record your character's currency totals here S A Doide it i e o A 5 fevel they v S5 they car ol during Class: Driuds can speak “Druidic’, are proficient in certain You can earn money fthLl_Qh quests, selling items or ﬁ_?EiVGO/ a short rest to regain health equal to what they roll. armors, weapons & tools. CP = Copper Pieces, SP = Silver Pieces, EP = Electrum Pieces, Background: Hermit are proficient in Herbalism Kits GP = Gold Pieces, PP = Platinum Pieces","libVersion":"0.5.0","langs":"eng"}