{"path":"Extras/Images/indian-spirit-1750284217180.webp","text":"SIS 2025 - BUSTOUR VOM INDIAN SPIRIT NACH BERLIN INDIAN SPRIT 40 = TQURBERLIN Y B3 Monday, 1 September 2025 @ 14:00 @ Eldena bei Ludwigslust p MEEFLIGY Promoter: indian Spirit GmbH [l M Ticketpriceincl. 10% presale fee w Travel comfortably and easily with our bus tour from the Indian Spirit Festival to Berlin central bus station (Messedamm), organized by Feierreisen. Arrive safely at your destination and enjoy the journey in a good mood! LEEY Please note that the tickets for the outward and return journey are individual tickets. IMPORTANT INFORMATION DOCUMENTS 1. Printed bus ticket (or clearly visible on your smartphone) + ID card LUGGAGE: 1. A maximum of: 1x camping/hiking rucksack or travel bag | 1x folded tent | 1x folded camping chair (or similar) | 1x small hand luggage/handbag | 1x sleeping bag/blanket | 1x sleeping mat or air mattress per person 2.No bulky items (e.g. tables, handcarts, crates of drinks, large cool boxes) 3. Please stick to this, because you can only take what fits in the trunk. NO DRUGS, NO WEAPONS, NO VIOLENCE! 1. We expressly point out that it is forbidden to take drugs, weapons or other prohibited items with you. 2. Exceptionally drunk, aggressive or under the influence of mind-altering drugs wil be excluded from the trip and will not be entitied to a refund of the fare. 3. Journeys to music festivals (by car, train or bus) are regularly checked by the police/customs PLEASE BE AT THE MEETING POINT 15-30 MINUTES BEFORE DEPARTURE Less ~ L TSR, | AR ) AR ||| e—— PRESALE STAGES Please choose the number of tickets you want at each rate. Persale stages. Rate Price Quantity Bustour Bustour Indian Spirit - Berlin Airport 4400EIR 2 v Bustour Indian Spirit - Berlin ZOB 4400EIR 0 v TOTAL 2TICKETS 88.00 EUR Ticket price incl. 10% booking fee Mytic myticket AG offers tickets for sale on \"myticket.de\" as a commissioned and authorized sales representative for the respective organizer. Please note that the contract is concluded with you in the name and on the account of the organizer.","libVersion":"0.5.0","langs":"eng"}