{"path":"Extras/Images/Pasted image 20240922215029 1.png","text":"Q: When should | use Amazon Kinesis Data Streams, and when should | use Amazon SQS? We recommend Amazon Kinesis Data Streams for use cases with requirements that are similar to the following: « Routing related records to the same record processor (as in streaming MapReduce). For example, counting and aggregation are simpler when all records for a given key are routed to the same record processor. + Ordering of records. For example, you want to transfer log data from the application host to the processing/archival host while maintaining the order of log statements. « Ability for multiple applications to consume the same stream concurrently. For example, you have one application TRaT Updates a real-time QashDoaTd and another that archives data to Amazon Redshift. You want both applications to consume data from the same stream concurrently and independently. + Ability to consume records in the same order a few hours later. For example, you have a billing application and an m It application that runs a few hours benind the biling application. Because Amazon Kinesis Data Streams stores data for up to 7 days, you can run the audit application up to 7 days behind the billing application. We recommend Amazon SQS for use cases with requirements that are similar to the following: + Messaging semantics (such as message-level ack/fail) and visibility timeout. For example, you have a queue of work b e e R S I S R S ‘completion of each ftem independently. Amazon SQS tracks the ack/fail, so the application does not have to maintain a persistent checkpoint/cursor. Amazon SQS will delete acked messages and redeliver failed messages after a configured visibility timeout. « Individual message delay. For example, you have a job queue and need to schedule individual jobs with a delay. With Amazon $QS, you can configure individual messages to have a delay of up to 15 minutes. + Dynamically increasing concurrency/throughput at read time. For example, you have a work queue and want to add mmure Teaders until the backiog Is cleared: With Amazon Rinesis Data Streams, you can scale up to a sufficient number of shards (note, however, that you'll need to provision enough shards ahead of time). « Leveraging Amazon SQS's ability to scale transparently. For example, you buffer requests and the load changes as a result of occasional load spikes or the natural growth of your business. Because each buffered request can be processed independently, Amazon SQS can scale transparently to handle the load without any provisioning","libVersion":"0.5.0","langs":"eng"}