{"path":"Extras/Images/bakalios-ptuxiaki-1748793380704.webp","text":"Configure cluster Configuration options - new i Choose how you would like to configure the cluster. © Quick configuration (with EKS Auto Mode) - new () Custom configuration Quickly create a cluster with production-grade default sttings. The configuration uses EKS Auto Mode to automate infrastructure To change default sttings priorto creation, choose this option. This configuration gives the option to use EKS Auto Mode and tasks like creating nodes and provisioning storage. T ——— Cluster configuration Name Use the auto-generated name or enter a unique name forthis cluster. This property cannot be changed after the cluster is created. | dimitris-dev-cluster J @ The cluster name should begin with leter or digit and can have any of the following characters: the set f Unicod letters, igits, hyphens and underscores. Maximur length of 100 Kubernetes version | Info Select Kubernetes version for this custer [ 132 v | Cluster IAM role Info Select the Cluster IAM role to allow the Kubernetes control plane to manage AWS resources on your behalf. This cannot be changed after the cluster is created. To create a new custom rol, fllow the instructions in the Amazon EKS User Guide [2 | AmazonEKsAutoClusterRole v | @ e Node IAM role info Nodes need an EC2 Instance IAM Role to launch and register with a cluster. To create a new custorm role, follow the instructions in the Amazon EKS User Guide [2. | carv-vanilla-node-role v | @ Create recommended role [ VPC | Info Select a VPC to use for your EKS cluster resources. | vpc-0d21cb0dbababa734 | eksctl-carv-eks—cluster/VPC v @ Subnets Info Choose the subnets in your VPC where the control plane may place elastic network interfaces (ENI) o facilitate communication with your cluster To create a new subnet, go to the corresponding page n the VPC console [%. | setect subnets v | @ Clear selected subnets subnet-08fd341a516535e2b | eksctl-carv-eks-cluster/SubnetPrivateEUNORTH1C X evnorth-lc 192.168.128.0/19 Type: Private subnet-08a09df7ab1e39376 | eksctl-carv-eks-cluster/SubnetPrivateEUNORTH1A X eunorth-1a 192168.96.0/19 Type: Private subnet-0c8b16a9051282dcd | eksctl-carv-eks-cluster/SubnetPrivateEUNORTH1B X' evnorth-1b 192.168.1600/19 Type: Private » View quick configuration defaults","libVersion":"0.5.0","langs":"eng"}