{"path":"Extras/Images/Pasted image 20240127155233 1.png","text":"JessICA CLAIRE ‘Momgomary See, San Fracics, CA 94105 ey ——————y [—— Open minde, fxible, et ity aiapece eamplayer ith st vl nd it commmmication sl baviog 10+ years o vl ‘roring exparience i il allral anromenes. Since 2017, e ke vaios T ol with had-onexperionce mangia hardvar, ‘contiming neveek, rchiecting d atomating ihty svalable s salable cloud ifasmctre. 1 bighly ocsed en deals madhave [ p—— Won Hasrorr T . — Verizon Commmmicaions—Deyes, OF Activ member of DevOps sgle team frdeiging s devloping ot clod sltions o st cit riremes S P S A A Contrinsing owaris maiesining clies sppicaion pime of 99 9. Cllsboraing closely i Des, QA, operaions teams md ther sakebolder, g effctve conmamicaion nd acive lening s ‘The most recent projecs ivolvd: + Setting enkinsppelie o implent CUCD o eploymmnt o Nodej-base s Gl ased splications cn el of ) msmces, lasic Beansnlk xvioments, e Kibenetescsters. Tols and plcoms wed: A, Jenkins, Docker et Kobemetes, G, DockecEi. - Developing DicaserRocovey las ing AW L oo (st i Python) th s he poces of ‘Sxlover o3 e region. Toos s plsfocss ed: AWS, Lambas, S (o3, ElaicBesalk, ‘DynaneDE, Bouess [ ——— - Actely levragin Torson o s vriows fsroche e forPro e, 2 QA cod s * Actvely involed in AWS v infsirctre mansgemet e responsle o operationssch s cretion of Pthon scripeed L ficrions and various CPN scks. - Seting up uly stosted CUCD rocsse g oo pipelines,Gifo, Docke, Docke b, B sciping 0 Taraonmcontiatin o 1< of e st deployment o sl o o 12 it * Configing 100 cloud s cn remsevrs i configaration managenent ool such 2 AWS Systems ‘Manage, Ancble CL ad Ansle Tower * Deploying e managing proucin ey, oo blaoced, nd ikl svalable Keberntes chsters with e TR A— T ————— ) P — * Keepingupon sy rends and et techocogical st ngusges,codin ek, toks and P p— 020198012020 AWS Clow Esgineer p—— + Was active b of ANV aative infasroctre managemns e respoasblefor oprsions sch s A role 0 policy cresions,managemen of Auto Scaling Policis Gronp, Secity roups s NACL coufgwaions, 3 ekt management, VPC pering connecios, CloudWach mad ClowdTral setings, deplometof s e 053, creaionof ClootFron dissions, management ofSSL cerifictions, management of Daibases, Eoaes e — * Pefomed egalar upstes, gt pemissions an configard esoutcesfr e employees s part of coboding proces.| + Monitred s managed 100s o serveswsing WS SSM o ot i p-ine s fcionsly. 0900178012019 Techmical Expert Ates—Vesbingon, DC - ol mofiied s repaird docana ofvare and hdsare o rslve el s + Cromodsppor docanenttion at empored s exbled edcaios] SafFo exend el leveags sy s p— + el comae syt roublesoing and prosed tecimica uppt 0 e o o computroprsions. B Ly + Conactad an sperisd iningof 100 fprofessionl eachers el 0 Cormptence Bosd Edocation. P SERC A g et S e S E———————————— [LE—— P Py ey —— - HadiCorp Coriid Trafrm Associste e S—-——— Samzs * AWS: CLL SDE (ot LAM, BC2, ASG, ELE, VBC, 3, CRY, + CUCD:Jeki, AWS CoePpelie, AWS CodeCom, AWS ‘L, ClonVc, EsicBentall, KD, ACM, S5, CoteBul, WS CodeDeploy Rouess - SCM Gt and Gt + Newoek prosocls: DN, HTTR ITTBS, SSH + Docker - Limxos + Kobamees o o - Tos, Contomce ppwies — ‘Bachelr o At Taik Language And Lifeatare RN SR —— pe———","libVersion":"0.5.0","langs":"eng"}