{"path":"Extras/Images/Pasted image 20240127161410.png","text":"° San Francisco, CA 12345 Fl rst La st +1 234 567-890 first.last@resumeworded.com DevOps Engineer linkedin.com/in/resumeworded DevOps Engineer with five years of experience finding solutions and determining customer satisfaction. Adept in developing products for web design, user experience, and best practices and speed. EXPERIENCE SKILLS Resume Worded, New York, NY Web Development Projects . Software Best Practices DevOps Engineer Website Optimization January 2020 - Present Zend Framework e Spearheaded hardware upgrades reducing power and rack utilization by OpenVZ/KVM 65%. Scrum e Implemented Virtualization using OpenVZ/KVM reducing Physical Nodes Hadoop from 60 to 6. SQL e Migrated data center of full hardware within 25 minutes. Data capture loss Continuous Delivery >1.5%. e Implemented cost savings to company of over $3M. EDUCATION Growthsi, Remote Resume Worded . University Lead Software Engineer July 2016 - January 2020 Bachelor of Engineering, i o i Major in Computer Science e Re-architected 5+ web applications from Code Ignitor to Zend Framework, resulting in a 35% reduction of lines of code. New York, NY e Managed infrastructure and systems during company growth from 30-65 o Awards: Resume Worded employees. Software Engineer Fellow e Designed a centralized “Reporting” server for distributed storage of gmly)s I?:_1“_/%11‘61661 t(?[\\dass)’ . ean’s List 2012 (Top normalized data for 50 MySQL/Hadoop servers. 10%), Graduated Magna Cum Laude Resume Worded, Boston, MA o Completed one-year Web Systems Administrator study abroad with January 2012 - June 2016 Singapore University e Resolved invoice/SOW conflicts which saved $20K on vendor costs. e Developed a team of five with ITS that smoothed communication bumps, OTHER hich Ited i % effici i ini depl t it Wi ;c t resulte -1r'1 a 4? ote '1c1er1cy increase in image deployment, security, o Volunteer 20 and storage pricing strategies. i gep & & i i hours/month at the ABC e Trained 3 new employees to complete new web projects which was . . i | i foundation, leading completed 3 times faster than the projected time. . software projects e PMP-certified (2020)","libVersion":"0.5.0","langs":"eng"}