{"path":"Extras/Images/skalwtikes_2.png","text":"Blues potiri nero sta bar loksigas simadema apo barman me karampina miga panw se xarti, skia sto parisi, stin sunexeia to inomeno vasileio kaliptetai apo aima https://www.Kith.org/logos/things/sitpuz/situations html https://hobbylark.com/puzzles/20-Realistic-Lateral-Thinking-Puzzles-and-Riddles-Brain-Stumper http;//www.rinkworks.com/brainfood/p/latreal1.shtml 1. Evag Tumoc Tpexet O evay SIaBpojo KpOTWVTE Evay XapToguhaka 2. Ta QT AVaBOGBNVOUY, KL O TUTIOG YUPVAX GOYONTEVHEVOS, O TUTTOG NTaY BIKNYOPOG KAt EVO AT TOUG TIEACTTEC TOU EIXE KATABIKATTEL GE BAVOTIXT TIOWN. Atyo TIpW TNV EKTEAEGT, O IKNYOPOS KATPEPE Vat BpEL ETUpKT) GTOIXEL Y1 VX XBUILOEL TOV TIEACTT) TOV, Yt AUTO KAt ETPEXE GTOV BIaBPOpO TG PUAKNG X TtpoAaBet Tov Bavarto. Ta guita avaBoopnoay, GUVETIG N MAEKTPIKN) KXPEKAG XPNIOUIOTIOMENKE Kot 0 BIKNYOPOG AMOYONTEVEVOG EYKATEAEE TIV TPOOTIaBEIa One day a man received a parcel in the post. Carefully packed inside was a human arm. He examined it, repacked it and then sent it on to another man. The second man also carefully ‘examined the arm before taking it to the woods and burying it. Why did they do this? The three men had been stranded on a desert island. Desperate for food, they had agreed to amputate their left arms in order to eat them. They swore an oath that each would have his left arm cut off. One of them was a doctor and he cut the arms off his two companions. They were then rescued. But his oath was still binding so he later had to have his arm amputated and sent to his colleagues. This is often told with a further twist whereby a doctor pays a tramp a large sum in order to amputate the tramp's arm which the doctor then sends to another man who inspects it etc. This variation can make for a long night of questioning! 1. EVaG TUTOG, GTapTa HTPOTTAl G EVaX EEVOBOXELD KAt EKVEUPITHEVOS PWVAZEL \"YaHu) TV TUXIEt [ov\" BPIOKOAOTE 0T TaUTEAO TN HOVOTOANG. O TaUKTNG, EpIEE TV TEAEUTEI TOU apLG 1 OTIOLG TOV TIOXPEDE VX OTAGITIIOEL JTPOCTO OT0 EEVOBOXELO EvOG GAAOU TIKT), TO KOOTOG To EEVOBOXELOU TOV 0BMYIOE E XPEWKOTIEL (TTOPEIG VAl TV YEITELS TV 10TOPLE IE GXETIKG GTOIXELX TIAVY 0TV QAOTOI TN UTIOBEaTIC) Mrtike oy KouZive, £KavE jua SriAwon, TiipE Ha GITGVTTon, Kat PET TIap' 6T povo auToc EEPE 6Tt fTav 0 A0POVOG, AVAKOIVWIGE HE QUTOTETOIBNGN 6T WipIZE To SpdaT Kot 0poAGYNoE Ta eV, cluedo METGt aTt6 EvVidk privE HETAVIIOE Y10 TO WK TIO E{XE TIEL OTIC SIOKOTEEG TOu Xnpax Bavorog K TEptovoia ompTo ot Pepetpo antras nekros gimnos k omacpevo oo dipla tou 3 iAot 0z pmap. A man pushed his car. He stopped when he reached a hotel at which point he knew he was bankrupt. Why? The man pushing the car was a player in a monopoly game and his game piece was a car.(isws kaluter diatipwsi stamatei stin plateia vathis monopoly) triantafulo k spori apo aktinidio skini 1i 0 petros einai se ena skoteino spileo skini 2i to swma tou skizetai se kommatia gummy bear in mouth enas ditis 2 metra katw apto nero nekros stin mesh tou dasous A man is lying dead in a field. Next to him there is an unopened package. There is no other creature in the field. How did he die? to paketo einai ena aleksiptwto pou den anoikse pote Five pieces of coal, a carrot and a scarf are lying on the lawn. Nobody put them on the lawn but there is a perfectly logical reason why they should be there. What is it? They were used by children who made a snowman. The snow has now melted. 0 petros kai i maria nekroi stin mesi tou saloniou ologimnoi kai gurw tous nera","libVersion":"0.5.0","langs":"eng"}