{"path":"Extras/Images/skalwtikes_3 1.png","text":"kaBws aplwnei meli stinn feta tou, sokarizetai k apelpizetai (guneka se 8eatro me aligino anti gia pseftiko maxair) 2 nekroi tupoi kai brosta tous mia teleiwmeni partida skaki kai ena asfairo pistoli 11 evao Turtog Acet \"Baothianc ohyag 13 2n KaToTY TEEQTEL VEKPOG reston and his men searched the frozen tundra for escaped convict Ben Barker. Just as they were about to give up, one of Preston's men spotted a body. Barker was found lying dead in the snow. There were no tracks leading to or from the body. The cause of death was partially due to the unopened pack on his back. Barker did not die of thirst, hunger, or cold. What was in Barker's pack that led to his death? Answer: An unopened parachute. False Assumption: That Barker's “pack” was a backpack. not a parachute pack. Also, he had arrived there somehow by land, not by air. A man is walking down the street, sees a bar and enters. He asks the bartender for a glass of water. The bartender pulls out a gun and points it at him. The man says “Thank you” and leaves the bar. What happened? Answer: The man who asked for the glass of water had the hiccups. The bartender pulled the gun to scare the hiccups away. False Assumption: That the bartender pulled the gun in order to kill the man. Itis a hot August afternoon. The location is the living room in an old Victorian mansion. The 7-foot window is open and the curtains are blowing in the breeze generated by the thunderstorm that just passed. On the floor lie the bodies of Bill and Monica. They are surrounded by puddles of water and broken glass. Please close your eyes and picture the scene. Now change the picture. Neither Bl nor Monica has any clothing on. How did they die? Answer: They suffocated. The storm winds blew open the window, which knocked their fish bowl off the table, and it crashed onto the floor. False assumption: That Bill and Monica are human. They are actually goldfish. © petros katakoitos nekros mesa se saouna.. dipla tou ena thermos (eixe ena mitero kommati pago me to opoio autoktonise kai eliwse) petros stin mesi enos dasous se lekanopedio, futia diasxizei to lekanopedio apo ton noto pros ton vorra.. o petros epizei.. (ekane antipiriki zwni me anaptira pou eixe stin tsepi tou) One day, | was waiting to get on the subway. | was eating the apple | always have for breakfast, and | decided to sit next to a homeless man on the bench. While waiting, we saw a fat man walk by us. The hobo then muttered, \"Pig.” Ididn't give it a second thought, except that the comment was rude. There were still a few minutes until the next subway train arrived, and another man walked past us. He was tall, wearing a business suit. As he walked past, the hobo said, \"Human.” | thought nothing of this remark, other than he was, obviously. a human. The subway finally arrived, and | left for work. The next day, the hobo was still there at the subway station. Today | watched from a distance. Several people walked past him; a skinny woman, a muscular man, and an old lady. In turn he muttered, \"Soup,” \"Pork.” and \"Cookie” Odd labels, | thought, because obviously none of them was a cookie. | got on the subway again, and proceeded to work. | could not stop thinking about the odd man at the subway station. 1 observed him for days to come, and he continued this odd behavior. He would call people bread, carrot. rabbit, milk, and other strange things. The next day, | walked by the homeless man once again, and he silently muttered, \"Apple.” Atthat point, | finally recognised what was going on. Then, remembering something, | was stricken with horror. What was the hobo's ability, and why was | horrified? Hint Iwonder what 'm going to eat for breakfast... Answer He was able to tell what people last ate. | told you in the beginning of the teaser that | ate an apple every day before work, and at the end he said \"Apple” to me. The reason | was horrified was because the first day | saw him, he had said \"Human” to somebody, implying that they were a cannibal. A tich man’s son was kidnapped. The ransom note told him to bring a valuable diamond to a phone booth in the middle of a public park. Plainclothes police officers surrounded the park. intending to follow the criminal or his messenger. The rich man arrived at the phone booth and followed instructions but the police were powerless to prevent the diamond from leaving the park and reaching the crafty villain. What did he do? AV 0F £Va HOVWHEVO BWHLATIO APNGOVHE TO YUYELD AVOIXTO, 1) BEPHOKPaOIa B aENBeL Ba petwBet ) Ba Tapapwe oTaBepn? Av 0F EVa TOTNPL VERO TO OTIOLO BPIGKETO Travw OF tat {uyapto BOAGUYE HEGQTO BOXTUAD HOG, Bt aMOEEL 1 EVBELEN 1) OXL. AV EXEIC [EpIK I aKIOX PEGCK OE £V TIOTIPL VEPOU TO OIOLO BPIGKETO GE BEpHIOKPABL SWHATION Katt auta Atwoouy, Ba GAAGEEL 1) GTaBN Tow VEpOu 1 X2 Answer This s a true story from Taiwan. When the rich man reached the phone booth he found a carrier pigeon in a cage. It had a message attached telling the man to put the diamond in a small bag which was around the pigeon’s neck and to release the bird. When the man did this the police were powerless to follow the bird as it returned across the city to its owner.","libVersion":"0.5.0","langs":"eng"}