{"path":"Books/The Daily Blueprint.pdf","text":"The Daily Blueprint Science-backed tools and protocols to maximize your productivity, physical, and mental health 1. How to Optimize Morning Light Exposure 2. How to Build an Effective Exercise Protocol 3. How to Recover from a Poor Night’s Sleep 4. Glossary 5. Links, References and Further Resources 6. About Dr. Andrew Huberman Appendix Phase 1: Waking and Early Morning (Hours 1–4) Phase 2: Midday Through Evening (Hours 5–13) Phase 3: Bedtime and Sleeping (Hours 14–24) The Daily Blueprint Table of Contents Delay your caffeine intake by 90–120 minutes after waking to help increase alertness and avoid an afternoon crash. (As a caveat: if exercising first thing in the morning, feel free to drink caffeine before exercise. Aim to drink around 32 ounces (1 liter) of water during this morning period, and add a pinch of sea salt for a source of electrolytes. Delay caffeine and ensure proper hydration A morning walk outdoors can provide you with both light exposure and optic flow, which quiets activity of the amygdala and related circuits and reduces feelings of stress and anxiety all day. Outdoor light exposure causes a beneficial cortisol peak early in the morning; increases daytime mood, energy and alertness; and helps you fall asleep more easily at night ¹. Prioritize light exposure each morning Phase 1: Waking and Early Morning (Hours 1–4) Drawing from 250+ hours of Huberman Lab podcast content, we created this Blueprint as a way to consolidate and condense the most impactful, zero-cost tools to maximize your daily routine for physical and mental health and performance. Thank you for your interest in science! T he Daily B lueprint ¹ See Appendix: 1. How to Optimize Morning Light Exposure The best time in the morning to do hard mental work is typically in the 1–4 hours after waking. Moderate-intensity exercise before a bout of deep work increases blood flow to the brain and can improve focus and productivity. Position your computer screen at eye level or above for increased alertness Use binaural beats of 40 hertz frequency if struggling to focus. White noise can also be effective. Otherwise, silence is best. Optimize your productivity Please use caution practicing this technique if you are prone to panic attacks or have high anxiety. Always practice seated and in a safe environment—and never near water, since this can cause blacking out, especially when extending the breathhold beyond 30 seconds. Sadly, people have died from “shallow water blackout,” which can lead to drowning in even very shallow bodies of water. To practice Take a deep inhale through your nose, immediately followed by a deep exhale (active or passive) through your mouth Repeat the above 20–25x, then fully exhale until lungs are empty. Hold for 15–30 seconds Repeat for up to 5 minutes total. Expect to feel a little tingly or agitated during the exercise. However, over the next few minutes, adrenaline levels will increase to greatly improve your focus and attention. Cy clic h y per v entilation shifts the autonomic nervous system towards feelings of increased alertness and enhanced focus. T his pattern of breathing consists of rapid inhales and e x hales, which causes hyperventilation, releasing adrenaline and thus increasing neural e x citability. Us e b re a t h i ng to i n cre as e e n er g y Eat dinner with some higher-carbohydrate (i.e. starchy but still complex) foods and protein to promote relaxation and sleep Get light exposure around sunset to reduce the negative effects of light exposure later in the night. Eat dinner and prioritize sunset light exposure Try to keep naps to 20 minutes or less to avoid sleep inertia. However, if you don’t feel an afternoon dip in energy or you tend to feel groggy after a nap, feel free to avoid them. Naps are not necessary. Use a protocol for 10–30 minutes to increase dopamine levels and mental energy ³. non-sleep deep rest (NSDR) Rest and recharge with naps or non-sleep deep rest (NSDR) Eat a lower-carb lunch to help avoid an afternoon crash Go for a short 5–30 minute walk after lunch to increase metabolism and further calibrate your circadian rhythm with light exposure. Optimize your food and hydration Exercise helps to regulate blood sugar, balance hormone levels, improve immunity, and depending on the type of exercise, can either increase energy levels or support feelings of relaxation ². Use exercise to optimize your energy levels Ph ase 2 : M idda y Th rou gh Ev enin g ( H ours 5–13) ³ See Appendix: 3. How to Recover From a Poor Night's Sleep ² See Appendix: 2. How to Build an Effective Exercise Protocol If you wake up in the middle of the night, use NSDR to promote relaxation and support falling back asleep quickly. Start dimming the lights shortly after sunset and avoid overhead and bright lights in general Dim computer and phone screens as much as possible, or use a red-hued filter to reduce blue light exposure Cool your bedroom to 1–3 degrees lower than usual Make your room as dark as possible using blackout blinds or an eye mask. Optimize your sleep environment To practice Take a deep inhale followed by a second, ‘top-off’ inhale to maximally inflate the lungs Release all your air with a full “lungs-to-empty” exhale Repeat 2–3x. Physiological sighing rapidly shifts the autonomic nervous system towards a state of increased calm. Even just 1–3 cyclic sighs can be effective, and if repeated as a short breathwork practice for five minutes a day, it has been shown in a to improve sleep, lower resting heart rate and enhance mood around the clock. clinical trial Use breathing to promote relaxation It is crucial to wake up at the same time (+/- 1 hour) each morning, days off included. Sleeping in later than that on the weekend is likely going to disrupt your circadian rhythm and make waking on your regular schedule that much harder. P rioritize a c onsistent sleep s c he d ule Phase 3 : B edtime and S leeping (H ours 1 4 –2 4) To dive deeper into the science of light exposure, we recommend visiting the .Huberman Lab Topics page on Light Exposure and Circadian Rhythm How to do it Look towards the sunrise or sun, but never stare directly at the sun. Blink as necessary. Wearing contact lenses and prescription glasses are fine, but aim to avoid using sunglasses or hats that are meant to block sunlight from your eyes. If you can’t get outside: Bright, blue-hued indoor lights will suffice, but try to get outdoors as soon as you can. Lux is a unit of measure of the intensity of light exposure to the human eye. Even on a cloudy day, outdoor light reaches around 10,000 lux, compared to a bright indoor light source, which is usually no brighter than 1,000 lux. How long Sunny day = 5–10 mins Cloudy day = 10–15 mins Overcast day = up to 30 mins Where Outside When Within 30–60 minutes of waking 1. How to Optimize Morning Light Exposure Disclaimer There are many factors, including your genetics, lifestyle, work schedule and threshold for change that will influence which protocols work best for you.  While habits and routines are ideally followed every day, consistency is more important than perfection. Aim to use these tools on at least 85% of days.  These tools do not replace the advice of a health care professional; if you have concerns about your energy levels, diet and nutritional needs, sleep, or general health, please consult a health care professional. App endi x To dive deeper into the science of sleep, we recommend visiting the . Huberman Lab Topics page on Sleep Hygiene Get up at the same time as usual. Sleeping more than 1 hour past your usual wakeup time can shift your circadian clock later (called phase delay), making it harder to fall asleep that night. Ensure you get adequate sunlight exposure soon after waking to support a cortisol peak early in the day. Delay caffeine until 90–120 minutes after waking to maximize the energy-boosting effects of your cup of coffee or tea. Exercise in the morning to encourage an early-day cortisol peak and provide a boost in adrenaline and focus. If you’re feeling tired in the afternoon, avoid caffeine and take an afternoon nap or use a 10–30 minute NSDR protocol to recharge instead. 3. How to Recover From a Poor Night’s Sleep If you’ve experienced a poor night’s sleep, your impulse may be to sleep in, drink a much-needed cup of coffee as you roll out of bed, and push your morning workout until the evening when you’re feeling up for it. B ut the best way to recover f rom a poor night’s sleep is to make sure it d oesn’t a ff ect your next night’s sleep . H ere are the most important protocols for recovering from short-term sleep deprivation : Neural Network Newsletter : Foun d ational Fitness Protoco Science o f M uscle G rowth , I ncreasing Strength & M uscular Recover D r. D uncan French : How to Ex ercise f or Strength G ains & Hormone O ptimi z atio GUE ST S E R IE S : D r. A n d y G alpin : O ptimi z e Y our Training Program f or Fitness & Longevit GUE ST S E R IE S : D r. A n d y G alpin : How to B uil d Physical E n d urance & Lose Fat To le a rn more ab o u t the science of e x ercise, visit the , or viewing the following reso u rces : Huberman Lab Topics page on Fitness an d Recovery T here are many ways to design an exercise protocol, depending on your current fitness level, goals, lifestyle and time constraints. 2. How to B uil d an Eff ective Ex ercise Protocol Sleep inertia is the grogginess and disorientation that people feel when they wake up from deep, slow-wave sleep. Napping longer than 20–25 minutes can allow the brain to begin a full sleep cycle. Trying to quickly wake up from the middle of a sleep cycle is difficult and can lead to even more fatigue and irritability than when you started your nap. Sleep inertia Binaural beats are a type of sound that can be used to bring the brain into different states of relaxation or alertness. They involve delivering a different beat pattern to each ear. The difference in what each ear is hearing (called interaural time differences) generates particular types of brainwaves. The frequency of binaural beats that appears to support enhanced cognitive functioning at the level of memory, improved reaction times and improved verbal recall seems to be 40 hertz. Binaural beats Optic flow is a phenomenon that occurs when we generate our own forward motion, such as when walking, biking or running. Visual images pass by our eyes, generating a flow of information that has a powerful effect on the nervous system. Optic flow has been shown to reduce the amount of neural activity in the amygdala, which is a brain structure that generates feelings of fear, threat and anxiety. Optic flow Cortisol, a hormone released from the adrenal glands, is the key driver that moves your body from sleep to waking. It is essential for the cortisol pulse to happen early in the day or early in your period of wakefulness. A timer is set when the cortisol pulse occurs, which dictates the release of melatonin about 12–14 hours later. Cortisol & cortisol peak 4. Glossary The question above was submitted by a member and answered during one of our monthly, members-only AMA episodes, where Dr. Huberman answers audience questions, including What is the best morning routine for people who work from 8 am to 5 pm? (AMA #1 Are there any science-backed protocols to increase deep sleep? (AMA #2 Is It possible to get a cold or sick from deliberate cold exposure? (AMA #7 Best productivity method: to-do list or time-blocking on a calendar? (AMA #7 What advice would you give to your younger self? (AMA #7) Huberman Lab Premium Watch AMA #1, question #1, where Dr. Huberman discusses how to use ultradian cycles in your daily work How do you use ultradian cycles in your daily work? (AMA #1) To better understand and leverage ultradian cycles for productivity: The tools shared in this Blueprint are zero-cost. To learn more about how supplements can aid in health and performance Listen to Huberman Lab episode: Visit the Developing a Rational Approach to Supplementation for Health & Performanc Huberman Lab Topics page on Supplementation for Health and Performance To learn more about supplementation for health and performance: Ex plore the followin g timestamps from Huberman L ab episode: Maximi z ing P roductivity, P hysical & Mental Health with Daily Tools Protocol : V iew N atural Light F or 1 0–30 min E very Mornin Protocol : Hydrate C orrectl Protocol : O ptimi z e Deep W ork : V isual E levation , U ltradian C ycles , W hite N ois Protocol : Reset the Mind & B ody , E nhance N europlasticity , Reveri . co Protocol : E at Dinner That Promotes Serotonin , C alm Slee Protocol : W eekends , Recovering F rom A Poor N ight ' s Sleep To dive even deeper on some of the tools outlined in this B lueprint: 5. Links , References and F urther Resources To learn more about Huberman Lab Premium and become a member, please visit hubermanlab.com/premium. In addition to the ability to submit questions to Dr. Huberman, Premium members also enjoy access to these exclusive benefits Monthly Ask Me Anything (AMA) episodes, plus access to the full archive of historical AMA episode Full episode transcripts for every episode of Huberman La Presale access to live events A portion of every Premium membership goes directly towards making a significant contribution to fund human scientific research selected by Dr. Huberman and makes science information accessible for all. Support Science and Our Mission Learn more about Huberman Lab Premium About Dr. Andrew Huberman Andrew Huberman, Ph.D., is a neuroscientist and tenured professor in the department of neurobiology, and by courtesy, psychiatry and behavioral sciences at Stanford School of Medicine. He has made numerous significant contributions to the fields of brain development, brain function and neural plasticity, which is the ability of our nervous system to rewire and learn new behaviors, skills and cognitive functioning. Huberman is a McKnight Foundation and Pew Foundation Fellow and was awarded the Cogan Award in 2017, given to the scientist making the most significant discoveries in the study of vision. His lab’s most recent work focuses on the influence of vision and respiration on brain states such as fear and high attention focus and developing rapid and effective tools for mitigating stress and improving sleep and other physiological metrics. Work from the Huberman Laboratory at Stanford School of Medicine has been published in top journals including Nature, Science and Cell and has been featured in TIME, BBC, Scientific American, Discover and other top media outlets. In 2021, Dr. Huberman launched the Huberman Lab podcast. The podcast is frequently ranked in the top 10 of all podcasts globally and is often ranked #1 in the categories of Science, Education, and Health & Fitness.   Subscribe to stay up-to-date with Huberman Lab Visit to explore the Huberman Lab archives, and if you haven’t already, sign up to the Neural Network—the Huberman Lab newsletter—to join 400,000+ other subscribers and receive regular emails on neuroscience, health, and science-related tools from Dr. Andrew Huberman Subscribe to the Huberman Lab podcast on , , , or your podcast player of choice. hubermanlab.com YouTube Apple Podcasts Spotify","libVersion":"0.5.0","langs":""}