4ops.terraform
a-h.templ
aaron-bond.better-comments
alefragnani.project-manager
alexcvzz.vscode-sqlite
anthropic.claude-code
bradlc.vscode-tailwindcss
britesnow.vscode-toggle-quotes
chaitanyashahare.lazygit
charliermarsh.ruff
dautroc.yazi-vscode
docker.docker
donjayamanne.githistory
dotjoshjohnson.xml
editorconfig.editorconfig
esbenp.prettier-vscode
fcrespo82.markdown-table-formatter
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
kevinrose.vsc-python-indent
kiliantyler.kubernetes-yaml-formatter-x
marxism.ai-token-count
mathematic.vscode-pdf
mhutchie.git-graph
mikestead.dotenv
mitchdenny.ecdc
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.vscode-node-azure-pack
ms-vscode.wordcount
ms-windows-ai-studio.windows-ai-studio
nicolasvuillamy.vscode-groovy-lint
openai.chatgpt
pascalreitermann93.vscode-yaml-sort
philstainer.git-worktree
pkief.material-icon-theme
pnp.polacode
rapidapi.vscode-rapidapi-client
rapidapi.vscode-services
raunofreiberg.vesper
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
saoudrizwan.claude-dev
shipitsmarter.vscode-change-naming-convention
signageos.signageos-vscode-sops
sirwanafifi.obsidian-clipper
solomonkinard.git-blame
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
subframe7536.custom-ui-style
svelte.svelte-vscode
tamasfe.even-better-toml
teamsdevapp.vscode-ai-foundry
tim-koehler.helm-intellisense
timonwong.shellcheck
tomrijndorp.find-it-faster
usernamehw.errorlens
wayou.vscode-todo-highlight
