# Brewfile.dev - Development tools

tap "oven-sh/bun" # Tap for Bun JavaScript runtime

# Languages and runtimes
brew "node"             # JavaScript runtime
brew "bun"              # Bun JavaScript runtime
brew "python"           # Python language
brew "go"               # Go language
brew "rust"             # Rust language
brew "openjdk"          # Java Development Kit
brew "lua"              # Lua programming language

# Version control
brew "git-filter-repo"  # Tool to filter repo history
brew "gh"               # GitHub CLI
brew "glab"             # GitLab CLI
brew "git-lfs"          # Git Large File Storage
brew "lazygit"          # Terminal UI for git

# Containers
brew "docker"           # Containerization
brew "docker-compose"    # Docker Compose for multi-container applications
brew "docker-credential-helper" # Docker credential helper
brew "colima"            # Container management tool
brew "lazydocker"        # Terminal UI for Docker

# Kubernetes tools
brew "kubectl"          # Kubernetes CLI
brew "kubectx"          # Kubernetes context switcher
brew "k9s"             # Kubernetes CLI UI
brew "helm"            # Kubernetes package manager
brew "kind"            # Kubernetes in Docker

# Cloud tools
brew "awscli"           # AWS CLI
brew "azure-cli"        # Azure CLI
brew "terraform"        # Infrastructure as code

# Database tools
brew "postgresql"       # PostgreSQL database
brew "mysql"            # MySQL database

# Development utilities
brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "httpie"           # HTTP client
brew "uv"               # Universal version manager
brew "pyenv"            # Python version management
brew "neovim"           # Neovim text editor
brew "sops"             # Secrets management
brew "opencode"         # OpenCode CLI
