# Core utilities
brew "stow"                 # Symlink manager for dotfiles
brew "git"                  # Version control
brew "starship"             # Terminal prompt
brew "coreutils"            # GNU core utilities
brew "gnu-sed"              # GNU sed
brew "grep"                 # GNU grep
brew "wget"                 # File downloader
brew "curl"                 # URL transfer utility
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast search tool
brew "mas"                  # Mac App Store CLI
brew "zinit"                # Zinit for Zsh
brew "zoxide"               # Directory navigation
brew "diff-so-fancy"        # Improved diff output
brew "jq"                   # JSON processor
brew "navi"                 # Interactive cheat sheets
brew "yamllint"             # YAML linter
brew "iproute2mac"          # IP routing utility for macOS
brew "tldr"                 # Simplified man pages
brew "as-tree"              # Display directory structure as a tree
brew "bat"                  # Cat clone with syntax highlighting
brew "tree"                 # Directory tree viewer
brew "eza"                  # Modern replacement for 'ls'
brew "yazi"                 # Terminal file manager
brew "atuin"                # Command history manager

# Fonts
cask "font-jetbrains-mono"  # JetBrains Mono font
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono Nerd Font
