[
  "obsidian-admonition",
  "table-editor-obsidian",
  "obsidian-excalidraw-plugin",
  "obsidian-git",
  "obsidian-hider",
  "obsidian-icon-folder",
  "obsidian-linter",
  "omnisearch",
  "obsidian-style-settings",
  "templater-obsidian",
  "obsidian-relative-line-numbers",
  "settings-search",
  "dashboard-navigator",
  "obsidian-vimrc-support",
  "homepage"
]
