[
  "table-editor-obsidian",
  "obsidian-excalidraw-plugin",
  "dataview",
  "obsidian-admonition",
  "cmdr",
  "dashboard-navigator",
  "obsidian-icon-folder",
  "image-converter",
  "janitor",
  "url-into-selection",
  "darlal-switcher-plus",
  "quick-tagger",
  "ribbon-divider",
  "settings-search",
  "find-unlinked-files",
  "obsidian-plugin-update-tracker",
  "obsidian-style-settings",
  "obsidian-plugin-toc",
  "templater-obsidian",
  "pinned-notes",
  "obsidian-linter",
  "meld-encrypt",
  "pexels-banner",
  "obsidian-tasks-plugin",
  "obsidian-statusbar-pomo",
  "iconic",
  "remember-cursor-position",
  "google-calendar",
  "sample-plugin",
  "obsidian-projects",
  "auto-file-organizer",
  "obsidian-hider",
  "markdown-tree",
  "custom-sort",
  "file-explorer-note-count",
  "quickadd",
  "code-styler",
  "fold-properties-by-default",
  "omnisearch",
  "obsidian-meta-bind-plugin",
  "obsidian-local-rest-api",
  "js-engine",
  "text-extractor",
  "ai-image-analyzer",
  "obsidian-git",
  "obsidian-file-link",
  "better-export-pdf",
  "pdf-plus",
  "vscode-editor",
  "homepage",
  "obsidian-book-search-plugin",
  "tag-wrangler",
  "notebook-navigator"
]